{"Fog Harbor Fish House": {"Angelita B.": "Our lunch began with a beautiful smile and warm welcome from Danielle, our waitress. We had the crab dip which was luscious and creamy with fresh crab. The sourdough rolls were simply the best we've ever had. My seafood risotto with juicy, tender scallops, crab and sweet shrimp had a light buttery sauce and was just divine. My husband throughly enjoyed his tangy cioppino with fresh fish, shrimps, clams, and mussels. Our service was perfect, the food was spectacular, and the view can not be beat. Bravo", "Alondra B.": "It was a wonderful experience. Oysters , clams , and swordfish were delicious . Would definitely come back. Bongjovi was a great server, with excellent service . Thank you so much !", "Brianna D.": "Amazing food, reasonably priced or what you get. Our server Bongjovi was amazing. Would definitely return!", "Mathew D.": "Fist time stopping in here for the family.The food was great and our server Shawn brought his A Game. Fast, helpful, and a nice guy!Will definitely return", "Sarah H.": "Finally got the chance to check out this place and was not disappointed! We started with the sourdough rolls that were very delicious. I got the seafood penne which had tons of seafood and was a very large portion, but slightly bland. My boyfriend got the fish & chips which were absolutely phenomenal. Service was attentive and make sure to book a reservation as lines can get quite long. If you're able to get seating next to the window, definitely do because the sunset view is gorgeous!", "Mike N.": "Indeed Best clam chowder soap. And yes go for the bowl. We also had the Seared Scallop & Crab Risotto and it was delicious .I've been visiting Pier 39 and bringing guest in the area and I've never tried this restaurant. Man now I know where I should ONLY go when at Pier 39. Can't wait to come back.", "Jordana G.": "An easy 5/5 stars across the board. All of the food was perfect in flavor, quality, and preparation. The service was quick, friendly, & knowledgeable. The restaurant environment was very nice just and lot of light came in. I especially enjoyed how large the windows are and that we can see the Golden Gate Bridge from our table. My only feedback here is that it was a bit stuffy as there wasn't much airflow, also it's a bit crowded.I'm so happy we dined here, the clam chowder was lovely and everything was delicious. The calamari tasted great and was the perfect texture.", "Sara T.": "I was visiting SF for a work conference and brought my mom along for the ride. We loved the food and entire experience. They did make us wait about 15 mins even though we had a reservation. The restaurant was completely full but the ambiance was relaxing. My mom ordered the mixed grill and loved it. We both really enjoyed the clam chowder and it was her first time trying chowder. The crab and scallop risotto was a hit. It was creamy and so comforting to eat.", "Tonya J.": "Great lunch. Fantastic view of the Wharf. We got the fish and chips and the clam chowder. Not bad. Husband loved the sourdough rolls. Make reservations in advance. We were seated after a very short wait. Very Busy spot. Lots to see.Note: They do validate parking in the near parking garage. Save a few dollars. Ask your waitress.", "Angela L.": "Fog Harbor's a tourist trap, and it shows through and through. Busy enough to have me wait on my reservation for another half hour or so, its interior's ruggish decor was, in the room that we sat in, a bit dark for my tastes. That is to say--I would have preferred more lighting if possible, if only so I could more easily see my food.Service was also rushed, in that I found myself feeling bad for my server as she checked in with us, remembering only mid-sentence that she'd forgotten to get us more water or plates like we'd requested. Still, she was a sweetheart, and I'd blame understaffing instead as she was constantly rushing from one table to another.The food was also rather mediocre. We got the Shellfish Platter, though our dish came with noodles instead of potatoes like the description on the menu said. While the noodles weren't a bad sidegrade on their own, I was rather disappointed as I 1) like potatoes and 2) ordered Seafood Penne as well, which had noodles that were strictly better.Our Raw Oysters arrived looking utterly miserable. Even the cheapest happy hour oysters I've gotten were shucked with more care, and some looked haphazardly thrown onto the shell.Taste-wise, nothing was immediately awful, but nothing stood out either. I focused on eating until I was full, then leaving and moving on with my night. This experience, I could have done without.", "Joel Jz Z.": "Found this place on Yelp. It's such a nice place upstairs at Pier 39.Went with a few folks, and we all ordered the same Mixed Seafood Grill. came with cod, salmon, and grilled shrimp. Started with an excellent clam chowder. House salad was just ok, but the rest was delicious! Take a walk around the area and enjoyed the view. The staff worked together to make sure we had a great experience.", "Rob K.": "Pretty fun restaurant. We had our name on the list and waited in the bar for our table. Apparently we missed them calling our name because we were in their adjacent bar \"The Eagle Cafe\". Nice bar, but more casual than the restaurant.We sampled many things. The crab cakes and Fried Calamari were awesome apps. Enough to share if you get both. I tried the Mixed Grill. The sauce really made the dish and it was nice to try three fish varieties. My go to is the clam chowder in a bread bowl. Hard to beat but I was feeling adventurous. I'd recommend both.They do being you a sourdough role, so even if you don't get the bread bowl you can sample the bread while you're here", "Rhona G.": "We reserved through Fog Harbor Fish House reservations on YELP and confirmed our window view table of Alcatraz. Make sure that you have all of your party at time of check in for your reservation. We were seated right away at time of our reservation and were able to order drinks and horderves also the meal if you're ready. Our waiter provided friendly and timely service. We ordered Nojitos, clam chowder and bruschetta to start. The non-alcoholic drink was a perfect treat as we enjoyed the window view over looking the bay and also Alcatraz on a nice sunny day on Pier 39. The clam chowder definitely is award winning. The bruschetta was a flavorful light start to our meal. We ordered the Cioppino and the petrole sole dishes. The sole meal was perfect especially if you like, spinach and potatoes. The sole fish meal was flavored and seasoned well. It's been a while that I've been able to enjoy such a meal. Now we see why thousand+ people had a meal here on Pier 39.", "Mark D.": "We were visiting pier 39 and always visit Fog Harbor Fish House when we're here. We had a party of 6 and surprising got seated immediately at a window seat. It was very classy inside and the view of the harbor made it pleasant to eat. We started off with appetizers. We ordered the crispy calamari ($17) and 1/2 dozen oysters ($24). After ordering the appetizers, we were given the complementary sour dough bread and butter. The bread was warm and the butter was creamy and easy to spread on the bread. We ordered linguini and clam pasta ($25) to share. Lastly, we ordered the clam chowder in the sour bread bowl ($14).The chowder came out first. It tasted great and I would recommend getting it with the bread for both the taste and the looks! The calamari was next and it was very crispy. The calamari sauce had a nice hint or garlic which was delicious. The pasta came out shortly after and you can taste the butter garlic and tomato sauce in every bite. The clams were small but there was lots on the plate. The garlic break was also a nice touch.Overall, good food and service. It's always busy but the staff work fast to get people to enjoy their food and leave feeling good. Definitely worth trying the clam chowder in the bread bowl if it's your first time eating here as well.", "Nancy C.": "Quick take: family favorite This spot is a family favorite for us. We have family visiting from the Midwest. My picky Chinese parents and kids like this place. Whenever we are in the area we must dine at Fog Harbor.We have been very lucky and got a table by tye window every time. Service is always great.I might be a bit bias because we have a lot of great family memories here.", "Mark P.": "First time checking out fog harbor the other day for lunch. They got us in right by a window right away even though it was busy. The waitress Amy m was very sweet and had great suggestions. Knowledgeable on menu. I had there famous clam chowder sourdough bowl. Your able to add crab meat which i did. It was well worth it. Amazing clam chowder. I had the griich hills Napa Chardonnay which is always good. For my main entree I had the seared scallops over crab risotto which was excellent! Highly recommend this dish. The view was nice. You could see the Bay Area and the Golden Gate Bridge. For desert I had the chocolate banana bread which was very good. I'll definitely be back soon keep up the good work!", "Faith B.": "So happy we were able to grab a table at Fog Harbor Fish House. We had read great reviews and I'm glad to add another one to the list. The food and drinks were all delicious. Everyone in our party was satisfied with their meals and everything tasted fresh and was beautifully presented. The highlight of the meal had to be the sourdough rolls! Oh. My. Goodness. The perfect balance of sweet, salty and a bit of tang...absolutely to die for. We even asked for a fresh basket before our dinner came and then there were plenty to take home with our leftovers. Out server was wonderful and made great recommendations and checked in on us from time to time. The restaurant is rather large, but it seemed like most table had a nice view. We were right by the window and it was stunning, the only downside is that as the sunsets the reflections can get very intense. Definitely add this spot to your list if you're busing San Francisco. Enjoy cocktails and dinner and finish the evening with a stroll on the pier!", "Seongsun J.": "In my opinion the clam chowder is the best and the only reason why I would come back here if at all. They have good bread to go along with the food, so I would recommend getting the soup bowl to pair with the service bread. We got the bread bowl, and the soup serving was drastically smaller. Came on a Saturday, and it seemed like the server was really busy and overwhelmed. They kept forgetting and messing up orders of other tables as well. The restaurant space is pretty big, so we didn't have much wait time.", "TaNeisha J.": "**3.5 Stars**Fog Harbor Fish House is mediocre. I immediately thought of a step above Red Lobster. Customer Service: Our waiter was very attentive; refilled drinks without asking, recommended dishes to try and was overall pleasant.Food: I love SF for the food! But Fog Harbor didn't leave me in awe. I ordered the Chargrilled Oysters for my appetizer and shrimp with broccoli for my entree. The oysters were ok; too much sauce. The shrimp with broccoli was also standard fare. Not bad by any means, but nothing spectacular. I would visit again, but I would rush towards the Pier if I had an option.", "Misty S.": "Great good, great service by Arif our server, and great view. The scallops and crab risotto was tasty and my husband enjoyed the sea food platter.", "Melanie M.": "My mom and I came here on a Friday and it was busy so I'd definitely recommend making a reservation. I got the lobster roll and thought it was good but a little overpriced. The service and ambiance was great though!", "Emily H.": "Definitely touristy...but for good reason. Beautiful views of Alcatraz and the sunset. Food was pretty good, no complaints there. The portions are HUGE so the price makes it worth it for 2 dinners. Nice staff and very attentive considering how busy it is. I would come back!", "Helen Y.": "Ambiance: We requested an outdoor seat and was placed upstairs overlooking the harbor. It was a beautiful and relaxing day, so this view made it even better. BTW the restaurant is on the second floor for those who get lost like me.Service: Our server was attentive, and several other servers stopped by to make sure we had napkins, more bread, and to check if we were happy with the food. Food: We got two lobster tails and a whole dungeness crab. The seafood tasted fresh and the steamed vegetables were fine. Pros of food:-Fresh seafood-Butter on the side-Large portionCons:-Too much butter in the garlic dungeness crab, made it too rich-Lobster tails were a bit rubbery-No seasoning for steamed vegetables, which would normally be fine, but some were overcooked (green beans wilted)Overall, I had a great experience here while visiting SF. I just wish the food stood out a bit more.", "Araceli G.": "Conner was an amazing server gave quality customer service definitely I will returnAnd recommend this place to my friends and family", "Robbie R.": "Came here solely for the clam chowder and thought it was quite delicious. Loved the sourdough bread bowl (highly recommend) and the overall vibe of the place. Very touristy and likely gets busy but still worth a look.", "Stephanie W.": "I saw this was highly rated, and I came here this afternoon just for something quick to eat with hopefully some nice ambiance with my boyfriend, and overall was quite disappointed by the experience, in particular the service.The waitress from the beginning was treating us kind of oddly. It's hard to describe, other than the vibes were kind of off, as if she didn't want to be there. Our food arrived fast (we just ordered a clam chowder each), and the food was fine. Nothing phenomenal or quite as special as they advertise, just some average, lukewarm clam chowder that tasted more like cream than anything. The sourdough bread was also not sour enough. For the price and portion, not impressed.Furthermore, we looked around and noticed that every other table at complimentary bread. Except for ours. Our waitress didn't serve us any bread, even though we were dine in customers as well. Come time to pay the bill, the waitress gives the bill to my boyfriend, and she points at the receipt and specifically makes note of the gratuity guideline... And then everything kind of made sense, the way she was treating us distantly and curtly; she did not expect us to leave her a good tip. My boyfriend and I are on the younger side, and she took one look at us and while she never said it to our faces, the vibes she gave screamed \"you look too poor to tip. I'm not wasting my energy servicing your table.\"Lol why are you entitled to my tip when there was 1) nonexistent service 2) no complimentary bread that should default be provided to all and the most aggravating fact of all, the audacity to suggest us to tip 18% and above... for what??? If she had not pointed the tipping guideline out, I would've tipped something at least, but after that incident? I do not owe you anything, much less 18% or more. Completely unprofessional behavior. This is a touristy spot. My boyfriend and I are locals; I guess this is what we get for eating in the heart of the wharf. Tourists and locals alike, please, take your money elsewhere, please. There are plenty of great food places in the city that are not a straight scam or tourist trap (and that will also treat you better regardless of what you look like), and these are places only a muni ride away.", "Ryen B.": "Fab staff, huge portions, pretty good food. The view is really wonderful from pretty much any table inside. Staff is friendly and efficient- even when managing a large group. Portions of everything are very large. Side salad was big enough to share. Menu is full of fresh seafood options. I went with the halibut- perfectly cooked, but a little under-seasoned. Fine stop if you are in the tourist area, looking for a nicer dinner, but ok in casual clothes, too.", "Luis R.": "Fog Harbor Fish House is a must-visit restaurant with an amazing view of the wharf. The restaurant offers a warm and inviting ambiance that sets the tone for a great dining experience. The warm sourdough rolls with fresh butter are the perfect start to any meal. They are crusty on the outside and warm and soft in the middle, making for a deliciously satisfying treat.The crab and spinach dip appetizer was outstanding, with fresh warm chips and nice chunks of crab. The creamy and cheesy dip is the perfect starter to any meal. The cup of clam chowder was rich and flavorful, with a good amount of clams and potatoes. The crab stuffed lobster was plated perfectly, with a generous amount of crab stuffing in the half lobster. The lobster tail was cooked to perfection and was on a bed of fluffy mashed potatoes and sauteed baby spinach. The mashed potatoes were light and airy, well seasoned, and the spinach was also well seasoned, making for a great dish.The service was excellent, with attentive and friendly staff. The restaurant is also an ideal date spot with the stunning view of the wharf and the great food.To end the meal, we shared the creme brulee which was good, although it was a bit inconsistent with the temperature and the sugar was not evenly torched on top, which detracted slightly from the taste.Overall, Fog Harbor Fish House is a great spot for a nice lunch, especially on a clear day, and it definitely works as a nice date night spot. The food is great, the service is excellent, and the ambiance is warm and inviting.", "Bella D.": "Luis our server was great! The food is Amazing here! Everything on the Menu!!! Highly recommended if you're in SF! You will not be disappointed ! :)", "Ashley L.": "Delicious and soo many options to choose from! They have Great Drinks and the Clam chowder is really Good Here! I recommend this place if you're in town or by the pier", "Brensi M.": "Went on Friday for lunch and the view from here is wonderful you can see the Golden Gate bridge, Alcatraz and the sea lions. Our waitress was extremely friendly, we were hungry so we ordered everything right away. The appetizer crab cakes were good and the salad too. The cream of the mussel fries were not that tasty, and the some of the mussel shells were cracked. The lobster roll came with fries and I was not impressed. The clam chowder was nice and hot as I opened the bread cover the smoke came out, but once I tasted it the flavor wasn't as great as I expected it. Maybe I was expecting more as this is suppose to be the best clam chowder. Nonetheless, it is a really nice restaurant and we had a great time but the food wasn't as good as we thought it would be.", "Anthony M.": "10/10 This place was absolutely unbelievable. The food was phenomenal and the view from the restaurant was amazing. Planning a return trip to San Francisco soon and will 100% stop in here again. Loved the ambience and different menu options as well.The only complaint I had was their policy of only 2 checks per table. I would avoid this place if you have a large party where you know this would be an issue.", "Leang E.": "Reservations were quick and easy. We were seated near enough the windows to see the sea lions out and the pretty view. We started out with some clam chowder and half a dozen oysters, which were really good. Then I had the garlic whole roasted Dungeness crab that came with potatoes and green beans and it was yum! Of course I couldn't pass up ending the night with the creme br\\xc3\\xbbl\\xc3\\xa9e. My gripe would probably be with utensils that weren't available or offered. It surprises me that they don't have seafood picks. I asked and there was a shell cracker and a seafood fork only. It was a bit messy but I made it work.", "Xue L.": "Came here around Christmas,even though they are packed ,we got seated quickly.Service was great,scenery is amazing.However food itself was disappointing.We love flew out of Vegas day tour San Francisco,we tried lots of other good restaurants based on yelp's reviews.There is even clam chowder place so good that we would go twice in a day.But Fog Harbor's clam chowder is a 1 out of 10.Risotto was mushy,3/10.If you want to go out for a date with nice view and good service but doesn't really care about food this is a good place.", "Divya K.": "Probably the most reviewed yelp restaurant I've dined at. Definitely met expectations. Ambiance is really nice and Yelp reservations are really convenient. We had a reservation for 9 PM (closing time). You can't really specify seating preferences on the reservation but we were seated from the table across the window. At night, you can't make out much of the view anyway.The lipstick lemonade was such a great cocktail. Food-wise everything was pretty good but not anything mind blowing I haven't had before. For apps, the blue cheese garlic bread was good but very strong on blue cheese. The crab and spinach dip was great, the regular dip on the bottom with crab shreds garnishing the top surface. About 15 chips to go with it. We also got complimentary house bread which were 2 small rolls with soft butter. In terms of entrees, we got the filet mignon and lobster roll. I really enjoyed my lobster roll which came with fries. I do wish they gave sauces on the side. You can get an hour of parking validated at the pier 39 garage - just make sure to mention it to your server before you leave.", "Erick R.": "Pretty good, oceanfront restaurant with a nice view of the sea and the golden state Bridge from afar. The food itself was really good. I ate until my heart desired for sure.The service was good. The waiter seemed a bit off but everyone has their off days. It was no big deal. They validate parking for 1 hour on the pier 39 parking garage.Would I return? Definitely. Give them a try then follow/tag us on Instagram/ tiktok @thehungrynomadz", "Brandon L.": "Food was mostly just alright - some standout bites within dishes but as a whole mostly just alright - and the service a bit awkward, but the drinks were great and I'm a sucker for a nice view so I might come back. Beside the mesmerizing view, the standout for me was the hibiscus brut drink. It's so rare that I taste something new and that edible flower at the bottom (had to Google it first to confirm, yes it's edible) was really something special. If they were brave enough to put it on the menu, and if enough people ordered it to make it worth keeping on the menu, I think marinated hibiscus flowers would be an incredible appetizer.", "martha a.": "Fantastic food. We came here as a party of 5 and the waiter was wonderful. The view was great. We got here at 5pm without a reservation and the restaurant did have seating.", "Frederick D.": "A corporate dinner at FH2, one of the premier restaurants on Pier 39, was spectacular.I wasn't facing the bay so my view was impaired, and there was too much glare to see out the window anyway. I'm sure it's nice.There is bar seating but we went directly to our tables. And the restaurant had set up two tables for our party.We ordered 2 dozen oysters about 4-5pp with a couple of the crab cakes, a cup of chowder, and an order of Ciopino - red sauce with a bunch of fish bits without the pasta. To wash it all down I had an hazy IPA from San Leandro, not my fave, not hazy enough, and a 2019 CabSav My Friendly Neighbor from San Luis Obispo, which was very smooth.Excellent service and company.This all came after a 2 hour scavenger hunt on the Let's Roam app.", "Dr. Gerardo O.": "No flavor. Service mediocre. Loud place. Tourist trap. Expensive for what you get.Clam showder have no taste.Small portion Fish, salmon has no flavor.Ok calamari.Has beautiful views of bay and the city. Nice location. You will have a good time but dont expect great food.Visited on april 2nd", "Brandon T.": "We dined at Fog Harbor Fish House last week, I had a fantastic experience. The restaurant's waterfront location provided stunning views, and the seafood dishes were fresh, flavorful, and beautifully presented.One minor downside to the experience, however, was the temperature inside the restaurant. It was quite cold, which detracted a bit from the overall enjoyment of the meal. However, this was a minor issue and did not significantly impact my overall impression of the restaurant.Despite the cold temperature, the service was excellent. Our server was friendly, attentive, and knowledgeable about the menu and wine pairings. They made great recommendations that enhanced our dining experience and made us feel well taken care of.", "Eric Y.": "Come for: Crab!!! Great cocktails, exquisite service, views of the Bay. And to experience a San Francisco classic institution. Perfect for special occasions.As an SF Native, I'm not afraid to say Fog Harbor is among my favorite restaurants in the city. (Yes locals do occasionally go to the Wharf too!)Located on the second floor of Pier 39, Fog Harbor is a beautiful restaurant catering to tourists and locals alike. It's fancy but not stuffy - everyone is made to feel welcome! The restaurant is gorgeous with booths and window-side tables. There's also a fireplace while you wait.Now let's get to the food. I have never had something I did not like here. Anything crab would be my recommendation - especially if you haven't had Dungeness crab before. You'll likely never have it better than here.On my most recent visit, I came for my birthday and got a crab and spinach dip, NY steak with crab, and a free birthday dessert! Both orders were from their Winter specials menu so take advantage of you get the chance.The crab and spinach dip came with tortilla chips and everything worked really well together. You can taste the crab, cheese, and spinach components. The star though, was the steak! I had mine medium rare and they cooked it perfectly. The steak had a wonderful charred flavor with sweetness from the crab meat. To top it off, the dish came with what I believe is a demi-glace sauce to add a nice umami element that made both the steak and crab meld even more. Again, I've never had anything bad here and this was maybe the best. Wash it down with a barrel aged manhattan and a not too sweet birthday dessert for a great celebration dinner.Finally, the staff. These people try! They do the little things to make your visit special and will bring their own positive flavor to it as well. Amazing food, breathtaking views, excellent service. What else could you ask for? Highly recommend you give them a visit if you get the chance!", "Allison W.": "Dined here on a Saturday (during the Ferry Building's farmers market hours) and the line was crazyyy, though it moved surprisingly fast! The interior is bright, cozy, and refined, with a wonderful view of the Bay Bridge. My friend and I were seated by the kitchen counter, and it was so nice to watch them prepare the dishes. Service was fast and attentive. For two, we split the shrimp po' boy and steamed mussels on pasta. The po' boy (+ the fries it came with) was perfectly meaty (they did not slack on the shrimp), and the fries that came with it were wonderfully seasoned (slightly spicy!). Would probably skip out on the steamed mussels next time, as the dish was a bit too watery for my taste. We each paid around $30--on the pricier side, but relatively reasonable for seafood. Would come back to try the oysters!", "Miles S.": "Stellar views and stellar food! Sensational seafood with views of the golden gate bridge if you sit in the corner! They got the food on lock like alcatraz (which you can also see out the window). Our server was great and the ambiance was welcoming. The chowder is legendary with the bread bowl and you gotta add a lil shredded crab on top too. Also peep the seafood tower, they got dang near the whole sea on that thang, it was hittin! Stay eatin!", "Maja D.": "My fianc\\xc3\\xa9 took me to San Francisco for a mini vacation and we took a walk down the pier after dinner where he asked me to marry him! Woo!Anyway, enough about me and more about Fog Harbor! It is in the pricier side but the view is amazing and the staff were attentive in the right amount. We got seated right at our reservation time and within 5 minutes of ordering drinks we were ordering dinner. Very efficient service.We got the whole crab with was boiled in garlic and butter as well as the seafood pasta which had mussels, shrimp, and some crab legs. It was all extremely fresh and delicious! Definitely make sure you have a reservation or you will wait to be seated. It's a pretty popular spot. I would always opt for the whole crab cause you get more meat.Definitely a place to try!", "Mersades C.": "The Ahi Tuna Poke was really refreshing and they have a great bowl of clam chowder. We also got the surf and turf, but I would pass if I came back. It was okay at best. The lobster was over cooked. Service was okay as well. Just okay. Nothing bad, but not the best. The restaurant packs up quickly and tables are close together, the lighting is really dim at night. Overall, it was good.", "Rucha S.": "DISAPPOINTED!!! Had a reservation for this afternoon. We checked in at the entrance and were seated within 20 minutes. The restaurant was busy. Our server seemed tried and not interested at all. Good ambiance, nice view to ocean and pier. Food : We ordered Crab Cakes, Garlic Roasted Crab and Lobster Tails, very mediocre. The lobster lacked any taste, crab seemed to be old, it was such a pain to remove the meat, the crab lacked any flavor of its own, it was just drizzled with heaps of garlic butter. If you want to enjoy crab, you can easily order two plates of crab cakes rather than ordering whole crab. There was nothing seafood about it, the taste was blah.", "Mia H.": "After walking along Fisherman's wharf and the pier, we decided to stop by here for dinner. Luckily we put ourselves on the waitlist beforehand, because if we didn't then the wait would have been really long. But! They did have a heated seating/waiting area, which was so so nice to have as it was cold. When we got seated, the waitress was very nice--maybe too nice as she also let us know she was going to the restroom so we wouldn't look for her (didn't mind it much but we were just confused ahaha). We got several dishes and they were all pretty good. The only thing is that they were on the saltier side, which I'm not the biggest fan of, but it was still good nonetheless. If you can, I highly recommend sitting at the window seat, which has an amazing view, especially at sunset. Overall, the restaurant was okay, but in my opinion, not worth the price.", "Mark W.": "We went here on a Friday night, party of 4, and had made a reservation a couple weeks in advance.We ordered a bunch of food but my favorite was the calamari, clam linguine, and garlic roastedDungeness crab.Overall I was expecting this place to be touristy with mediocre food, but I can assure you that I was wrong and the food and service was fantastic! If you are lucky you might also be able to grab a spot by a window with amazing views. I will definitely go back to this spot.", "Darrell L.": "We really enjoyed our meal here. Our server, Bong Jovi, was fantastic. He made some great recommendations with our appetizers, drinks, and my entree. I was really appreciative of his knowledge of the menu and what was the freshest fish available. The tuna tartar was out of this world. We also did the oyster Rockefeller that didn't disappoint. I had the halibut and my had the linguine with clams (hers was better). The drinks were great. I wish we had room for dessert as the options looked great. I would definitely recommend this place and ask for Bong Jovi if you can.", "Mike M.": "We stopped in for oysters and a drink. Every stool in the main restaurant space was packed so we decided to head off to the bar on the left side of the hostess' podium. I am sure we took the fork less traveled. Our plan was to sample six north point oysters before an elegant meal elsewhere. I am glad we did. The oysters were terrific and spectacular. It has been at least a 15 years since I wandered around the Embarcadero area. I did not expect such a pleasant \"snack\" at Fog Harbor. Most know my vino of choice is a red. Although, the Sauvignon Blanc from New Zealand was a perfect pairing with the oysters. It truly injected me with power. Also, applause to Lindsay the bartender for being so kind, patient, and a pro at her craft. The next time I find myself in San Francisco, Fog Harbor Fish House will be on my things to do list on the city on the bay. I can say I left my heart for oysters at Fog Harbor Fish House.", "Jasmine C.": "I brought my family who's visiting from another country here on their first day after arriving in SF- and it was a great choice to create a first impression of the city! The restaurant is located at Pier 39 with a nice view of the pier. There is a huge selection of seafood dishes- we ended up getting the seafood grill platter, scallop risotto, salmon + mussels pasta, and a crab. It was plenty of food for 5 adults to share. The food was great and the service was decent. It's pricey but overall the experience was worth it.", "Craig W.": "Rules to live by: Most restaurants near the water--in any city--are terrible. Most restaurants on Pier 39 are terrible.Fog Harbor, which is on Pier 39, and on the water, is a very pleasant exception to these rules.The clam chowder is very good. The fresh bread is excellent. The lobster roll was very disappointing. There wasn't much lobster and what lobster was there was mostly minced-up meat. It costs a brutal $33. A much better entree is the ahi tuna poke. It's a solid, very attractive dish.The drinks are good but don't sleep on the mocktails. The non-alcoholic Blackberry Press was absolutely delicious.Almost all of the tables have great views. Use the Yelp waitlist to avoid lengthy waits.This is a solid restaurant lost in a sea of Bubba Gumps.", "Mikhil C.": "I was pleasantly surprised by the quality and service of this place! We had some friends visiting, so we naturally took them to Pier 39, and I assumed I was going to be roped into a low quality, tourist-trap type of establishment. While this place was a bit costly, it was super solid!Between the (4) of us, we ordered the following:- Crab & Spinach dip [really tasty but a relatively small portion for it being $19!]- Crab Cakes [fantastic, but again, very small cakes for $20!]- Lobster Roll (2) [super buttery roll with a decent portion of lobster. The fries were pretty weak - cold/soggy and there was a fair amount of shells in my sandwich, but it happens...]- Seared Scallop & Crab Risotto (2) [this dish was amazing and the best value order on the menu, in my opinion]The waiter was attentive and helpful, and had a funny demeanor. The space itself is well-lit and scenic with good views of the Bay - try to sit by a window! We might have lucked out but we only waiting 5 minutes to be tabled.", "Audrey K.": "A classic seafood restaurant at Fishermen's wharf. It gets quite busy due to its central location, so I recommend making reservations in advance. There's a parking structure across the street, but keep in mind that it's $12/hr and the restaurant only validates for 1 hr. Anyway, onto the food:- Ahi tuna poke: super fresh, served with avocado and some Sriracha and mayo based sauce. It only came with four chips though, wth. - Bleu cheese bread: very cheesy and delicious, can't go wrong- They also serve sourdough bread and butter. Baked to perfection - Clam chowder: in a bread bowl or with a salad. It's not too clammy and apparently it's award winning- Mixed grill: sole, shrimp, and salmon grilled was totally bomb. The green bean sides are nothing to write home for though - Scallop and crab risotto: so good! Creamy and crabby rice with seared scallops. Definitely my favorite.They have a full bar and tons of good drink options. They have a lager that they brew in house, which was quite tasty. The Escape from Alcatraz cocktail was absolutely amazing - pretty much a mai tai with a twist. My uncle got an old fashion, a classic that you can't go wrong with.Overall it was a great dining experience. Friendly waiter and quick service. A perfect night out!", "Jorge C.": "We had an absolutely fantastic time at Fog Harbor! Daniella, our server, truly went above and beyond to make our experience unforgettable. Her recommendations were spot-on, and we were blown away by the red chili shrimp appetizer. The bread bowl soup, with the added crab as suggested by Daniella, was a taste sensation that left us wanting more. To top it off, the jalape\\xc3\\xb1o margaritas were the perfect accompaniment to our meal. The food itself was outstanding in terms of quality, but it was the impeccable service that truly made our visit exceptional. We can't recommend Fog Harbor highly enough for a positively delightful dining experience.", "Theresa S.": "Always wanted to try this spot, but every time we went during the weekends, the lines were too long. Luckily for us, lunch on a Friday around 12 was no wait.We were able to get a window seat, which my sons enjoyed. Even with the light rain, the view was nice.The food was great. Having been raised in the Bay Area, we don't go into SF and do the touristy stuff, so this was my first time getting clam chowder from Pier 39, and boy do I regret not getting it in a bowl! The chowder was amazing! Glad I added chunks of lobster to it. The calamari was also nice and crunchy. And we all have no complaints of our entrees. Will come back during summer when the weather is warm and we can thoroughly enjoy the view.", "Nina Renee N.": "Absolutely phenomenal. We had Luis as our server and he was wonderful. Excellent table-side manner, fun personality, knowledgeable about the menu. We split the bruschetta and a cup of chowder. There's a reason it's award winning, I suppose. I got the cioppino and my partner got the pistachio crusted halibut with ber blanc. My partner is a sous chef and said \"the composition of the dish was great, the vegetable complemented the crust excellently and the sauce itself was delicious\". Cioppino is my favorite so I knew I was in for a treat. Everything was fresh and well prepared and I cannot express how wonderful Luis was. We will be back next time we're in SF.", "Latasha B.": "Amazing meal! We hadn't been here before but heard great things. Service was great along with our meal and cocktails. I tried the blood Orange Margarita that was topped with foamy egg white. I have never had a Margarita with that on top and surprisingly it was very good. For appetizers, we had the broiled oysters and they were amazing. I'm very picky when it comes to oysters like this and I was a little apprehensive to try them, but they wowed me as well. We also had a crab cake app as well. For our entrees, we ordered the seafood grilled plate that came with fish and shrimp along with green beans and mashed potatoes and I had the scallop risotto. So delicious everything was cooked perfectly and was well presented on the plate. Needless to say that this was a happy dance for my tastebuds.", "Maruko X.": "Ambiance: spacious ocean front establishment, stunning view is right in front of the long window seating zone, where Golden Gate Bridge and Alcatraz come into sight Service: friendly and provided useful suggestions, though it's a bit slow, had to wait long for water and the bill in the end Food: very fresh seafood and combination choices available  CLAM CHOWDER - **** award winning, one of the best in SF, balanced flavors not overly salty, recommend Mixed Grill - **** Grilled salmon, Pacific cod and shrimp, citrus beurre blanc, saut\\xc3\\xa9ed vegetables and garlic mashed potatoes, shrimp was tasty, salmon was soft and melting, cod was over cooked, still recommend for its variety Price: moderate portions and reasonably priced for being in a tourist attraction center, expect $50+ per person", "Jannah C.": "Visiting from Georgia and came here based on a recommendation from my concierge and it did not disappoint. The food was prepared quickly, as described and was very flavorful! 4 Star worthy! If you are in need of a good meal in the heart of the Wharf, this is your place. Also, the views - wow! You can't beat that! This rating is 5 stars because of my server Shawn. He was knowledgeable, warm and had a great sense of humor. While executing his duties as a well trained server he did not miss the opportunity to make us feel like old friends. He also spoke closely and clearly so that my mother who is deaf in one ear could hear (we appreciate that!).As he told us after our meal, \"Thanks for the company!\", I wanted to double down on that thanks, and thank HIM and you all for a great experience.", "Juanna F.": "Went here with some friends without a reservation on a Saturday morning and we were seated when we arrived. For appetizers, we got the calamari and clam chowder with crab on top for an extra $7. The calamari was yummy but about half of it was fried onions and even lemon pieces. The crab that came on top of the clam chowder was a stingy amount, about a teaspoon worth of crab. I ordered the mixed grill for my entree and I enjoyed it. It came with grilled cod, salmon, and shrimp. I asked for some lemon to add brightness to the dish. I enjoyed the mashed potatoes that came with it. The green beans were alright, I would've preferred different mixed vegetables. My main complaint is that the restaurant is so crowded. The waiter and other customers kept bumping my chair and my head at some point. It's in pier 39 and comparable to the other restaurants there. Good, but nothing special.", "Melissa A.": "Decided to come to Fog Harbor for Xmas eve & to end the work day w/ a good meal. Also to mention an overlong due of a visit. I tried to RSVP a week in advanced but it was a NO go. Luckily w/Yelps help I was luckily to be put on waiting list. In less than 15 minutes we were seated with a view. Place was packed & we were hungry. For Starters, Clam chowder bread bowl is a must in this cold Sf weather (and you have to eat at least some of that soaked goodness bread bowl! ) also Cesar salad for balance (which was shared). Main course Mixed grill that consists of salmon,cod&shrimp which were all grilled together with saut\\xc3\\xa9ed greens & garlic mashed potatoes. Ended with dessert of course (leave room!) Arif who helped us made our visit pleasantly nice, took good care of us with his service!", "Justin G.": "We had the clam chowder bread bowl and the mussels and they were delicious. We sat outside and celebrated a birthday and Daniela B made our visit one to remember :) thank you for being so attentive, personable, and making an impact on our day in beautiful Sf!", "Erica B.": "Best on the Pier!If you want great food and a fantastic server run to Fog Harbor. Daniela is the number one server on Pier 39! Friendly, helpful and funny she is a must. The clam chowder was the perfect balance. The sourdough was warm. Traditional dishes were consistent and what someone would expect. If you go, you must try the halibut!", "Anne M.": "We wanted to sit by a window for the view and they were very accommodating--we only waited about 5 minutes till we sat down. Our friends recommended this restaurant and we weren't disappointed. We ordered the blue cheese garlic bread, steamed clams, the clam chowder bread bowl and salad combo and a lot of bowls of chowder . The blue cheese garlic bread had a lot of blue cheese--which my MIL loved. However--there was red pepper flakes under it so it was a bit spicy for her taste. The steamed clams were delicious and so was the chowder. It wasn't too fishy and I like having bacon in it. There was a nice amount of clams in there too. We could tell that the Caesar salad dressing is probably made in house but it was more like a vinaigrette. We prefer a creamy caesar dressing. Overall, it was a great experience and the food was delicious--service was quick. We would go there again!", "Jimmy T.": "Seafood platter was delicious. I added the lobster tail. Great choice if you want a bit of muscles, shrimp, clams, half a crab and noddles. Girlfriend got crab ravioli which was also good. Crab on top and inside the ravioli. Service was great. Server was attentive, offered good recommendations and friendly.", "Peter M.": "This seafood restaurant on Pier 39 is rated to be one of the best in San Francisco. For cocktails ...we had the lipstick lemon drop which contain citrus vodka, triple sec and fresh squeezed lemon shaken and layered with black raspberry liquer. Another cocktail was the Alcatraz escape ....which contains white rum, coconut rum, orange and pineapple juices, grenadine and a float of dark rum. The other cocktail ordered at our table had no alcohol and it was a strawberry basil nojito....it has fresh mint, basil and strawberries muddled with fresh lime juice and soda water. There was applause for the second and third cocktails.We skipped the appetizers and went straight for the main dishes because we wanted to have room to try several desserts. We had the following. Pesto chicken pasta came with tomatoes, spinach, peppers, onions, garlic basil pesto and Parmesan. Another dish we ordered was a crab ravioli which was on the specials menu. Five skinny raviolis for over $30. Two of us ordered the lobster tails ...each order comes with two lobster tails ($53). The menu stated that the tails would be 5 to 6 ounces. This was clearly not the case. They were much smaller. The tails came oven roasted and accompanied with drawn butter, saut\\xc3\\xa9ed green beans and garlic mashed potatoes. Here, the tails were overcooked, while the beans were undercooked. The mashed potatoes were good. Overall, the pasta was the only adequate portion.We ordered three desserts .....the first was a Blondie Sundae, this is a chocolate chip style brownie square with walnuts and topped with vanilla ice cream, Biscoff cookie crumbles and Biscoff sweet spread drizzle the second dessert was an apple crisp \\xc3\\xa0 la mode this comes with Granny Smith apples and a buttery crumb topping served warm and topped with vanilla ice cream ....and finally we had the vanilla bean cr\\xc3\\xa8me br\\xc3\\xbbl\\xc3\\xa9e. All the desserts were good.In summary, the service was good, but the restaurant is pricey (over $300 for 5 people). Price for me is generally not an issue ....but you should get what you pay for. Parking is in the garage across the street and the restaurant validates only for one hour .....that is not always feasible because service is slow which means you have to pay for the other hour or more, as was in our case. The big positive here is that we wanted to eat here on New Year's Eve and they told us that they have a lot of tables for walk-ins and that was exactly the case.... I got in a waiting list when we were within 1 mile of the restaurant and our table was ready the moment we arrived.", "Stacy A.": "My family stumbled upon this restaurant after eating at Franciscan's and liked this restaurant so much better! This restaurant is right at the start of the pier 39 boardwalk. The crab, lobster, and oyster were a lot more fresh and the environment is also nicer. Highly recommend! Our waitress was named Shakura and she was AMAZING! I couldn't have asked for better service. She recommended good dishes and was on top of checking in on us. She made our dining experience even better. :)Dishes: - shellfish platter (for 1) w lobster tail: 9/10, comes with garlic noodles and an assortment of seafood - garlic Dungeness crab: 8/10, same flavor as the shellfish platter - crab stuffed lobster: 6/10, had a fishy taste and was very underwhelming, do not recommend this special", "Taisha Y.": "I made reservations for my bf birthday dinner. We were seated after a few minutes of waiting. I told the host that it was my bf's bday to see if they offered a bday dessert which they were kind to note & mention to our server. The food was decent, I don't why I expected this restaurant to have good food. It's located at Pier 39, one of the busiest tourist attractions but, with such last minute planning, this was the only place that was taking reservations. The service was wonderful, we truly had an amazing time with our server who later walked out with a candle lit bday dessert. As a local, I wouldn't return, I'm sure SF has way better restaurants.", "Jacky U.": "When in the Bay area, a must go! Excellent food and view of the harbor. Worth the wait.", "Taylor G.": "Excellent clam chowder & bread! And even more excellent service from Daniela!!!! 15/10, do recommend", "Maria Rachel O.": "My husband and I had a fantastic time at Fog Harbor. We were seated by the window with the view of Alcatraz. The food was delicious, the service was outstanding, and our server, Arif was very friendly.We will recommend to family and friends", "Courtney O.": "Fog Harbor is such an experience! From the amazing ocean views, to the amazing food, to the warm atmosphere - it's a must for sure when in the City!They have great cocktails like Love Potion which included Gin that made the drink a pretty purple and pink color! The Blue Cheese Garlic Bread was a hit and we devoured it. For my entr\\xc3\\xa9e, I ordered the Shellfish Platter for 1 with the added Lobster Tail (when in Rome, right)? It was San Francisco on a plate and everything was cooked to perfection! You also can't go wrong with the oysters and anything with shrimp is for sure to please! You're greeted with warm bread and salted butter and your server really knows how to make sure you're well taken care of.Fog Harbor is on the pricey side for sure, but you definitely get what you pay for. We visit Fog Harbor every time we are in the City and are never disappointed!", "Runzer W.": "The bread bowl is really worth trying! And I also ordered a crab cakes, which was also fresh and delicious too. The service was friendly and kind. They gave me a seat right near the windows, where I could see the beautiful scenery. A wonderful time inside!", "James Y.": "This picture-esq restaurant located at the touristy spot known as Pier 39 is pricey but the food was done extremely well. While Fog Harbor is frequented by tourists left and right, the quality of the food is something that San Francisco can be proud to call its own. We had 2 visitors to SF and decided on Fog Harbor, right across from the parking building. What a food experience. Service was really just so-so, nothing spectacular, a bit over-worked, but it was fine. The food, however, is where the experience was where my expectations were over-taken.Poke, clam chowder bread bowl, clam linguini, salmon, the grilled mix plate... all done superbly well. Oh, and the table rolls are sour dough, yum. I'm going to leave this review rather short, but it was all done rather well. Salmon cooked better than I've ever had salmon anywhere else and the clam linguini was the quintessential, textbook clam linguini that that dish was intended to be. So good.", "Jessica O.": "Revisited FHFH Dec 2022 on for the first time in more than a decade, after moving away from the area. Checking in for our reservation was chaos. Service, otherwise, was okay.My husband had never been to SF, nor had he eaten Cioppino or Clam Chowder. We started with oysters on the half shell. Then I ordered the chowder in the sourdough bowl and a ceasar salad and he ordered the stew. All dishes were as good as I remembered and really hit the spot on a very cold, very wet Dec day in the Bay.", "Justin N.": "Fog Harbor was delicious. We went a couple days after Christmas right around 12:30 and we're expecting a long wait as we didn't have a reservation. However, our party of 6 was seated within 15 minutes which was great. All of the food that came out was delicious! I will add though that they don't have too many vegan-friendly options. But for the seafood lovers, this is a great spot.FYI: it is on the second floor on the left right when you get to Pier 39", "Ashley F.": "Tonight we had a lovely dinner at Fog Harbor! We had reservations but arrived early, so we decided to grab a drink at the bar. We ended up deciding to stay at the bar for dinner because the bartender, Nelson, was great!Everything we ate was delicious - crab cakes, chowder bowl and dessert duo. The dirty martini and espresso martinis were yummy as well. Next time we're back in town we'll be back and we hope to see Nelson again!", "E S.": "I made reservations, requested by the window they said we have to wait another hour if we want the window lol so never mind that. Foot was good except Cioppino. Their Cioppino is just full of fish. I wouldn't recommend it. Everything else was great! (Would have been nice having great meal with awesome view by the windows lol)", "Randall S.": "Let me start by thanking all my fellow Yelpers who went here before me. For years it was a tradition whenever i visited San Francisco, i would eat at Alioto's. Sadly they closes their doors forever last year so i was looking for a new seafood place. Whenever i've had this problem, i look to see what pops up on yelp. This was #1 on the list I decided to check it out. Located in pier 39 with lots of other interesting shops & restaurants, it has a nice view of sf bay. The food was excellent and portions were generous. The service was wonderful and it was a pleasant relaxing experience. Pier 39 has its own parking so you don't have to look for parking. This was a great experience!", "Daniella B.": "The food was great and in a nice location, and our server Daniela made our party's day. Thank you!", "Emmanuel M.": "We had the pleasure of being waited on by Bong Jovi. He was amazing from the very start. Incredibly attentive and humor only found on big venue Vagas shows. The food could've tasted like sand and moss, and I still would have given 5 stars due to Bong Jovi! However, that was surely not the case. The garlic crab was delicious and perfectly seasoned. Cioppino was rich and flavorful with big chunks of crab meat, and the clam chowder definitely deserved the title of award winning. The restaurant was clean, and the ambiance was perfect. The host and staff were pleasant and welcoming. 10 out of 10 would recommend. Aloha from Hawaii,Manny (Bong Bong) and Amanda M.", "Diana T.": "Everything here is soooo good! Located on pier 39 on the 2nd floor. During lunch time, they are separated from eagles Cafe but during dinner, they combined and become 1 restaurant. Pretty unique.Their bathroom even have someone to open the door and pull out napkins for you to dry your hands.Super fancy!Must try their rissotto and bruschetta!", "Lesley P.": "Delicious Shark steak cooked to perfection & Fish & Chip Good too , Friendly tentative service, Nice & Busy @ Pier 39 Great Views of the bay", "Daphne L.": "Calamari cooked to perfection , not spicy even with Blood Orange Margarita Delicious , Efficient service, Main Entree Petrol of Sole & Grilled Mixed Surf, Delicious", "Dilys S.": "Fog Harbor lives up to the great reviews! I tried the calamari and the linguini and clams. Both were delicious - I loved the fried jalape\\xc3\\xb1o and onions that are mixed in with the calamari. The linguini was rich with a well balanced flavor and the clams were cooked well, not rubbery at all. The portion was large and is easily big enough for two meals if you're not super hungry. I, on the other hand, chose to stuff myself because it was too good to stop eating. To drink, I had the blood orange margarita. It was yummy. Very well balanced drink. My dining companions agreed that all their drinks were well balanced too. The restaurant is bustling inside. Completely full on a Friday night - we had a reservation but still had to wait 15 min for a table. I appreciate that I didn't have to keep checking in though, the hostess found me herself to provide updates (didn't catch her name unfortunately). Our server, Jim, was also wonderful. I would recommend coming here whether with family, a small group of friends, or a date. The views of the harbor at sunset are beautiful. I plan to return sometime to try the cioppino.", "Noelle N.": "We loved our special night with Fog Harbor and our waiter Bong Jovi (cool name). Highly recommend the seafood here - it's a true experience. Whole roasted crab - people love the ceremonial bib service. They are so considerate, they even ask about whether you want the crab facing you or away. The Korean influencers next table filmed their entire meal. Gotta take friends out of town here. They will have a blast. Especially international friends. crab house is quite an experience.The crab could be even more fresh and tender. But I feel that's what all crabs taste like around the Bay Area now. We requested extra melted butter to keep it tender. It helped!Famous clam chowder by the cup. There's so much food to consume and it is heavy. Unless you have a big family I highly recommend you get the cup first. It's creamy and great.Caesar romaine salad: exactly what you expect a good classical flavorful salad to be.Linguini clam pasta seems so simple but this one of the few places that does it well. It's delicious and affordable highly recommend it. It's my favorite.Prosecco and Gloria from Carneros by the glass is affordable $10-$15", "S S.": "This place is amazing. Friendly staff and really amazing crabs! Love the garlic butter. Generous. I take all my friends visiting from Japan and China here. The international, picture based menu is really helpful too. It is an easy going place, real American, pier spirit, perfect stop for the Pier visit after a brief look at the sea lions. I love this place. The staff makes the dinner feel really classy while the price is super reasonable. There's a bit of helping tying the plastic apron - again people get a big kick out of it and end up having a great time here.", "RC R.": "Service was great! We loved Bongjovi as our waiter. He was very attentive to our table and made some great jokes and conversation. The drinks and oysters were also delicious. The clam chowder bread bowl was a bit underwhelming, but overall, it was a good dining experience.", "Olivia R.": "Lovely san francisco style seafood dish. Also, great clam chowder!This is definitely located in tourist-landia - I wouldn't go back to the location personally. BUT, if that's what you're looking for, this local restaurant seems to be the best choice on that pier with incredible water views and great service.", "Cindy C.": "Fog Harbor feels like the kind of place you visit for the overall ambiance and views since it's perched right on pier 39. The food was good though a bit pricey in my opinion, but still a solid place to visit especially for tourists!My boyfriend and I came here for our anniversary dinner a few weeks back with a reservation, so we were seated immediately with no problems. This place definitely gets busy so would recommend reservations if you don't want to wait!We started out with the baked oysters which were super flavorful and definitely a good appetizer to begin with. Then I had the seared scallop & crab risotto and my boyfriend had the cioppino. The crab risotto was packed with crab meat which I loved, and the scallops were good but a little bland. My boyfriend did enjoy the cioppino which was chock-full with seafood in a tasty tomato broth that was perfect on a cold SF evening. For dessert, we split the apple crisp a la mode which I would highly recommend if you love warm apple desserts :)", "Sirikanya p.": "Located at a tourist area made this place really popular so get there early to make sure you don't have to wait for a long time. Food wasn't that impressive. Cioppino had too much tomato taste. Mixed grill was nice as well as mashed potato that came with it. Linguine and clams was ok while clam chowder was served with a lot of clam which was nice and oyster was fresh and its sauce was tasty.We ordered a bottle of wine which tasted nice and not too dry. One interesting thing though, when I first got there it seemed to me that this place try to be fancy by the way of the table setting and how staffs dressed but the way our server poured wine was not the right manner....... But that didn't bother me since I enjoyed the time with my friends and service was nice. Just to point that outSunset in the evening made this place so beautiful. Don't forget to validate your parking ticket!! I got $10off .", "Lydia K.": "BongJovi is simply one of the best servers we've ever experienced! He has excellent recommendations, he's very warm and he would come check on our table before we would have to ask. The Cioppino here is delicious, the crab cakes are good and the Cream Br\\xc3\\xbbl\\xc3\\xa9e. The atmosphere is perfect, relaxing music and beautiful Christmas Decor. This is our second time here and this time it was more enjoyable because we had excellent service .", "Kathy V.": "After all these years visiting Pier 39, I've never eaten at Fog Harbor Fish House. The idea popped in my mind when my daughter said I want Oysters for her Birthday. Luckily they were able to take us in without reservations. I might say service was superb and food was excellent. I'm not going into details regarding each item we ordered but no complaints from me. It's comforting when you see your child smile and enjoy the food.It was a great 21st Birthday", "Juan V.": "This is a very good place to grab seafood in San Francisco even if it's in a touristy area. I really enjoyed the food and the service . Great views of the water and great atmosphere to enjoy some great seafood. The seafood grill plate was delicious along with the crab cakes and the clam chowder. The cr\\xc3\\xa8me br\\xc3\\xbbl\\xc3\\xa9e was tasty. A must visit if you haven't and you are craving some great fresh seafood.", "Sarah B.": "Great seafood. We got the clam chowder in a bread bowl and the seafood tower. They were amazing. It was absolutely enough for 2 people. The views are great if you can get a table along the window. Our server was very nice and kept up with drink refills and extra napkins", "Melody K.": "We decided to try a new place to dine at Pier 39 rather than going to our usual spot, so we went with Fog Harbor Fish House since they had good ratings. They are located at the front on the second floor and have a nice waiting area. The Yelp waitlist was easy to register and when it came our turn to go in, I realized how big the place was.Ambience: (5/5) Their location provides a stunning view of the water almost wherever you sit. We were seated right at the window which gave us the perfect view without being blocked. The indoor ambience was nice and comfortable. I can understand why so many people dine here because just for the ambiance alone, if it weren't for bad service, it's worth coming here.Service: (1/5) I was thoroughly disappointed in our waiter's lack thereof service at lunch. I saw other waiters/waitresses were friendly and checked on their customers more frequently compared to our waiter. What bothered me the most was that he barely checked on our table in comparison to the rest of his customers. We were the only Asian customers that he served while we were there. Not only did our food come out later than the other table that arrived after us, but he only came by to check on us once. When we asked for a box for our left overs, he acted as if he didn't know what we were saying at first. After paying and tipping, he looked at us and shook his head. We tip generously for great service and still tip for very bad service, but tips shouldn't be expected if you barely provide service and make your customers feel less than. Since the beginning it seemed like he was annoyed and didn't want to be there, so I decided not to add oysters to our order. I don't mind slower service if they are busy, but I do mind bad and lack of service on top of being treated differently which ruined our experience.Food: (3.5/5) The reviews for their food was pretty high so I was excited to enjoy a good lunch. However, the overall experience was just mediocre. We really enjoyed their complimentary bread and butter (5/5)! Wish we had more during our wait because the bread was warm and chewy and the butter was rich. Their fish and chip was good as well (5/5)! Fish was fresh and soft and the outer coating was nicely done, not too thick. The side of coleslaw had a kick to it which was very enjoyable. Next came the clam chowder bowl (4/5). I read great reviews on their clam chowder and it was good, but unfortunately nothing special. I've had better clam chowder at Chowders. You'd think the most expensive dish would be the best, but the shellfish platter for two people was a miss this time as it was our least favorite dish (2/5). The dish was overcooked so the meat was on the rougher side and a bit too oily for my taste.Price: (3/5) The prices were a bit high for the quality of food and service we received during lunch. However, since we're also paying for the view and ambiance, the price is fair.@Bob: Hi Bob, we were there on Saturday, 2/11/23 around 1:30pm.", "Candace I.": "Great solid seafood restaurant for this area. Beautiful views of the bay. Service was fast and friendly. We were there during the lunch rush on a Saturday. I would recommend reservations since it does get busy.", "Linda C.": "My partner and I stopped in here for lunch. We wanted seafood so we decided to make a trip Into San Francisco and visited the peer. The hostess was somewhat friendly but was annoyed that we didn't hear her call our name. We had waited in the room off to the side, to stay out of the cold, but also the lobby was packed full of people. Our server was phenomenal... very friendly and attentive.The food was delicious. My partner older the clams with linguini and I the shell fish platter which I shares with him. We both order the clam chowder. The chowder was voted the best, though it was delicious... it wasn't the best we have had. The rest of the food was good and tasted fresh.", "Sheree Z.": "Our waiter Bongjovi was absolutely amazing! My family used to own restaurants and we would have hired him in a heartbeat. He was SO attentive, wholesome and genuine. Even though it was busy, we still felt so cared for. My water glass was always full and he was great at giving recommendations on what's good on the menu. When he saw that I was staring at the ocean, he opened the curtains for me, WOW! SO ATTENTIVE The clam chowder was good but not life changing I would come back for the ocean view and Bongjovi!! 10/10", "Khrystine C.": "We made a reservation after reviewing their special menu for restaurant week. I'll admit it was a little bit confusing, because we had to ask for the restaurant week menu AND the entrees were slightly different from what was being advertised on the website. Slightly bummed, but I didn't really care unless it tasted delicious. (They did also update their menu on the website after our visit.)The appetizers were delicious, we got oysters & calamari. The oysters were fresh, and I loved that the calamari also included fried onions and jalape\\xc3\\xb1os! The calamari was also a really big serving (: The creme brulee was also good.The entrees were just okay. I got the shellfish platter which I read beforehand came with fingerling potatoes, but was later changed to garlic noodles. The noodles were a little too al dente & the seafood was overcooked. My partner got the steak which we thought would come with shrimp and crispy rice. They were able to add the shrimp but no rice. He also thought the sauce needed to be cooked more.Service was amazing though!", "DeAnne V.": "Our family ate at Fog Harbor on a family trip to San Fran. It was packed when we visited but the wait was not long. Service and decor were ok. Their clam chowder/ Caesar salad lunch combo were a good deal and proportioned appropriately. My kids loved the fish and chips although it was a little pricey. The best experience was the sourdough bread. It is San Francisco, after all!", "Jahmal P.": "They made V day extra special for us. So I took bae here we both love seafood and our waiter Shawn C was quiet but attentive and amazing. Ordered drinks first Alcatraz escape and blood orange margarita both topped off per the suggestion of our server. Loved both drinks strong and full of flavor. For apps we ordered the tomato bruschetta and the fried calamari. I swear. The bruschetta was amazing the cherry tomatoes still had a bite to them the sourdough bread was fresh mozzarella. We got the surf and turf and I had the shrimp with the scallops. The steak was prepared nicely and seasoned decently, the lobster tail  Steamed just right not rubbery. The shrimps and sauce nicely done. My scallops were seared perfectly. Everything was delicious and the great service. This place is def a top pick on the pier. Thank you for making V 2022 great sorry for the late review forgot it in the draft, but I still remember how great our meal were.", "Brooke B.": "FOOD & DRINKS - 4/5My drink of choice for this evening was a Strawberry Lemonade ($6), which was good, more on the sweeter side. They served us complementary warm bread and butter while we waited for our main courses. My mom ordered the Shellfish Platter for 1 ($48). The portion of seafood served over buttered noodles was very generous and could have easily been split between 2 people. Nevertheless, the seafood was fresh and delicious. I ordered the Ahi Tuna ($37) served with white rice and a mix of bok choy & spinach. Again, a generous portion size, and the tuna was cooked perfectly and paired well with the tomato reduction sauce, but I felt the rice was a little dry or old, too stiff for my taste. AMBIENCE & DECOR - 4/5The place reminded me of Cheesecake Factory with lots of seating and big open windows. The tables were packed pretty tightly together though. I enjoyed our view of the harbor and the sunset was stunning that evening. SERVICE - 5/5We made a reservation, despite it being a weeknight because the high ratings for this place made it seem like it would be busy regardless of the day. And I found it to be true! We were seated right away at a table close to the windows. Our server and host were super friendly and accommodating. PARKING/TRANSPORTATION - 5/5We walked to Pier 39 and thus were able to find the restaurant pretty quick (upstairs). While I'm unsure of where one would park, our server mentioned that they validate for parking so that's good to know! tldr; came for the view @ sunset, food was good with big portions but not anything particularly superb", "Teresa L.": "I don't recommend coming here. The place has a nice view of the water and customer service is great. But let's talk about the food. Spent about $100 for 1 meal and it was so bad I ate half and walked out. I got the lobster and steak dish at medium rare, and presentation wise, it looks great. Although, the steak came out still mooing and the lobster was incredibly chewy. I asked to get the steak cooked just a little bit more after I cut it open and got the same cut pieces of steak back, but instead this time it was cooked like they wanted to burn it black. Most places would give you a new price of steak if it wasn't cooked correctly and most wouldn't just burn it just to be petty. They do have $10 validated parking and since parking in sf is expensive, it only covered about 1 hr of parking.", "Karina P.": "Stopped in here (with a reservation of course) on Sunday afternoon with 2 friends from out of town!I wanted to take them somewhere with a nice ambiance to enjoy seafood -- this spot has raving reviews and is located in the heart of pier 39. We were seated within 5 or so minutes of arriving and I found the staff to be really kind.All 3 of us for clam chowder bread bowls and these are a steal given the nice restaurant! The total per bowl was $12 -- can't beat it! The clam chowder was hot, tasty, and perfect for the overcast weather that day!I will definitely return here in the future whenever I am craving clam chowder. Great service, great food, great ambiance!", "Regis K.": "One of our favorite seafood places in the Fisherman's wharf area. It's a bit hard to make reservation but we managed to make a booking for lunch on the weekend. Many people come for the seafood and their clam chowder. Three of us all ordered a sourdough bread clam chowder and loved it. The chowders were very creamy and tasty. We also ordered a seafood platter which included shrimps, mussels, clams, and dungeons crabs. The platter came with linguine pasta. The seafoods were very fresh and we loved the pasta. Service was excellent and we got very attentive and quick response from our waiter. Overall, I recommend this restaurant for seafood lovers. Get the seafood platter where you can sample all your favorite seafood here.", "Olivia N.": "Good restaurant with nice views. Our server was friendly and attentive.The food was great!We started with the bruschetta and some clam chowder and bread service. All were fresh and delicious. We had the shrimp Brochette plate, which came with a whole dozen shrimp!Also ordered the Mixed Grill and the Alaskan Halibut. Everything was delicious. I'd you're at Pier 39 and are looking for a nice restaurant, not too casual, with good food, this is it.", "Xiuhui M.": "my boyfriend literally got food poisoning and threw up in a parking garage so no i wouldn't recommend coming here. if you have to come, don't get the cioppino because that's what he got and it did him dirty.caesar salad + clam chowder: 7.0/10 | clam chowder is kind of gritty ?? not good texture. salad was the highlight.cioppino: 0.0/10 | consume if you want to yak your guts out in the parking garage three hours later.", "Cyn T.": "my boyfriend literally got food poisoning and threw up in a parking garage so no i wouldn't recommend coming here. if you have to come, don't get the cioppino because that's what he got and it did him dirty. caesar salad + clam chowder: 7.0/10 | clam chowder is kind of gritty ?? not good texture. salad was the highlight. cioppino: 0.0/10 | consume if you want to yak your guts out in the parking garage three hours later.", "Grace C.": "We came here at a time that patrons were being asked to show their proof of COVID-19 vaccination cards for dining in. You could always select to use their outdoor dining to not have to show a card.There was a line of people waiting to get inside. Each person ONLY had to show their CDC proof of vaccine card to get in. When our turn came we showed our cards and the folks at the door asked for a PHOTO ID as well. We showed it, but mentally noted that NOT ONE PERSON AHEAD OF US WAS ASKED TO SHOW THEIR ID.I didn't want to make a big deal of it because I was hungry and wanted to order.The restaurant was not full at all when we first arrived. We chose to sit in the back where the windows were opened and a breeze was blowing.Jim was our server. We placed our order of clam chowder, etc.Our food ended up being just okay. Because we've been here many times and the food and service was good we will look to return in the neat future.", "Candy K.": "I always enjoy Fog Harbor! They served hot crusty bread and butter. Not a lot of places serve got bread anymore or perhaps I'm not going to the right restaurants. LolTheir service was topnotch! There was tons of fast moving servers and lots of clientele ready to be served. The place was bustling with activity though we felt very taken care of.Their clam chowder is the bomb diggity! It is thick, rich, full of clams and potatoes. Not too creamy. Just how I like it.We ordered the fish and chips and this was my only area of concern. The fish was tasteless. No flavor at all! Very disappointing.Since we were running to catch the ferry we didn't have time to have the order remade.I'll still go back again and enjoy that crusty bread and clam chowder. Yum!", "Courtney W.": "This is a must visit restaurant when visiting SF!! Highly recommend! Went on thanksgiving day and surprisingly there was only a 10 min wait. There was more ppl than I thought dining out . First year having no Turkey on thanksgiving, this year is a seafood thanksgiving haha! We had a nice view next to the pier , can see the boat. Ordered the below items:Oyster- very fresh and loved it with the cocktail sauce Clam chowder- originally wanted to get boudin but any restaurant near the pier makes fresh and delicious chowderLinguine and clams pasta- clams were fresh but tiny. Good flavor! Mixed grill- vegetables were cooked nicely with red bell peppers, came with buttery and soft mashed potatoes, grilled salmon, pacific cod and shrimp Would come back again if I'm visiting SF!", "Nazh D.": "We came here for our three year anniversary, and had the most amazing experience with great food, and a very attentive and kind server, Luis. We had the calamari, clam chowder, and cioppino. All of these items were recommended by our server, so we tried them and we're very satisfied! They even gave us a free dessert for our anniversary! The atmosphere is very lively with wonderful views of the harbor.", "Alyson N.": "Great option for dining at Pier 39! We came right when they opened and got a table no problem but there was definitely a line forming already, so a reservation is a good idea. Service is good- all the staff are nice and professional.Sourdough rolls are warm and have a great texture. Good way to start. Could have eaten so many of these.Crab cakes had a good amount of crab in them and were nice and crunchy on the outside. Good flavor and a nice sauce to balance out the saltiness of the crab cake. Clam chowder is pretty decent, not as heavy and cream-forward as other chowders I've had, but I feel it's a good option if you're craving a soup. Very filling as well.Cioppino was my favorite thing. The sauce is somewhere between a tomato soup and a pasta sauce consistency, and you're going to want to dip your bread in it. The crab meat is lumped right on top in a big pile. Lots of bits of seafood like mussels, clams, fish, shrimp, and it's all so flavorful. A must have in San Fran.Total, this meal was about $100 including tip. I feel it's a little pricey, but food is well executed and service is good. Also can't beat the view- it's right on the pier and if you sit by the window you can see the sea lions with the Golden Gate Bridge in the distance.", "Julie w.": "This place was located at the beginner of the Wharf. Such a cute place with a very nice view. We purposely went here for the clam chowder and the cioppino, which did not dissapoint. Their clam chowder had a thick creamy texture, adding crab meat suggested by our server made it waaay better.The cioppino was also good and so meaty, had right amount of fish and other seafood.We also got ahi tuna with avocado, it was good but the chowder was the star of the night for me.The alcatraz drink was good, it had pineapple and three different kind of rum. Its good but a little too strong.For dessert we had apple crisp with vanilla icecream on top. Great way to end dinner. Love the chowder though, I would come back just for that.", "Rachel W.": "Such a lovely time at Fog Harber !! Bongjovi was a fabulous waiter who treated me well on my first time here. Fabulous service, fabulous view, and fabulous food. Will definitely be back!", "Rikki Erielle N.": "Best place to eat on Pier 39 with a great view. Luis was amazing. Food was delicious.", "Amy C.": "I came here with a large group and the service was quick! Definitely would recommend if you are in the neighborhood, it has a touristy feel but it's perfect for when you have friends visiting SF. The views were also beautiful, you can see the pier. The appetizers were alright, I didn't think it was anything special. But the steak of the surf n turf was delicious, exactly as I imagined for medium rare. The lobster tail did feel a little over cooked but not bad. If you have room for one more thing, the tiramisu was amazing! I'm very picky about my tiramisu but this one really hit the spot, it was creamy and didn't fall apart. Enjoy it with a shot of espresso on the side.", "Anusha V.": "We were in the area and randomly decided to go here since it was close by. We then saw the amazing reviews on Yelp and boy were they right!!! I love that you can book a reservation or join the waitlist right through Yelp. They also accept walk ins and you can put your name at the door and they'll text you when they have a table ready for you.Now coming to the food.. I got the crab and scallop risotto and my husband got the seafood cioppino. The risotto was one of the best things I had on my trip. It was beyond delicious and I wish I lived close by to go have this again. The cioppino was also great and my husband thoroughly enjoyed it. If I'm ever in area again I'll definitely be back!!!", "Karen Z.": "Food was good! My friend and I ordered the clam chowder (in bread bowl) and seafood platter and it was more than enough! Seafood platter tastes really fresh, we also added lobster, though towards the end it kind of tastes oily. The sour dough tastes good.I added that we are celebrating so we were able to get a table by the window!", "Anthony C.": "Not worth it or great. Went here because of the stellar reviews but damn it was expensive and not very good at all. What happened to everyone who gave it great stars they get hit with the head with an old white sturgeon or did they have a different chef? The waitstaff was slow and mistake-y but nice. The lobster tail I had was yummy enough and the shrimp was good but maybe on par or below Red Lobster. Actually, dang! Red Lobster is so much better! We live on the coast and eat fancy fish plenty and this ain't it. The free bread rolls were loved more than the chicken tenders by a kid who wondered by no sauce with them or plum/sweet and sour or BBQ - they brought ranch when we asked. The bread rolls were alright.Update Nov 7 - reply to Resturaunt manager's reply- we went on Saturday nov 5th", "Madhu P.": "Food was delicious! Had the mixed grill dish. Our server Bongjoyi gave great recommendations.", "Lexi D.": "I have been meaning to try some classic San Francisco Clam Chowder, and I decided that Fog Harbor Fish House would be the place. I ordered the Soup/Salad Combo with the Clam Chowder Sourdough bread bowl, and Caesar salad with shrimp (shrimp suggested by waitress over chicken). The Clam Chowder was immaculate. I have nothing to compare it to, but by the time I inhaled it, I started going at the bread bowl too. The salad was just a salad, and if I went back, I would stick with ordering only the clam chowder. Another bonus is that bread is brought out before the meal, which was needed for us hangry girls after a long day of walking around SF.", "Zandreia K.": "I was here on a work trip, and this place was highly recommended. The location is excellent, as it's right on the pier--the atmosphere, once inside divine. The service from hostess to busboys/girls was fantastic. The food, however, was the real reason you came was average at best. I was highly disappointed in the seafood platter, there was plenty of garlic and butter on the plate, but none of it made it into the flavor of the food.", "Michelle D.": "Had dinner here and we put ourselves on the waitlist here on Yelp prior to arriving - super convenient! We got seated right away which was great because there was clearly a little wait. Our server Ron was awesome! Very attentive and good with tips/suggestions for our meals and drinks. We ordered clam chowder, salad, and I also ordered a shellfish platter for 1. It was good but I was not wowed by it. Worth a little fix if you're craving a little seafood. Noodles were literally just butter and garlic which was a little too much after a while - id probably recommend getting a side of lemon to break it up a bit.Our dessert- we got the cookie with ice cream i Don't remember the name of it but it was sooooo delish! We would probably come back for the clam chowder bowl and this dessert honestly lol.Overall we were satisfied with our experience. They were super busy yet we didn't feel like we were left waiting forever to be attended to which was good. We were in and out for our meals in an hour which is perfect when considering the parking rates in the area. Also - views of the ocean is a huge bonus!", "Jenn W.": "We had an amazing dinner here. I had made reservations a couple of weeks in advance and requested a table with a view of the bay. We arrived to a super busy restaurant but got the table we were hoping for! I had the shrimp brochette, and it was so tasty. Twelve shrimp grilled perfectly, with a small carafe of drawn butter. Side dishes were garlic mashed potatoes & asparagus. My daughter had a Caesar salad & clam chowder in a bread bowl. She loved both! Service was exceptional. This is one of the nicer restaurants in the Fisherman's Wharf area, and if you're in the mood for seafood, it's a definite \"must\" to visit.", "kevin f.": "Slogged through Sunday traffic to be told \"We're closed for an emergency \". Thanks for the heads up-AFTER dealing with FW traffic. As much as i have liked this place, it comes to a point whether it's worth dealing with the location...and all that entails.", "Ginger O.": "I was hesitant to book this place as it is in Pier 39 but since my brother was in from out of town and it had good reviews I went ahead and booked a table for 4. We decided on 3pm on a weekday and the place inside was very full.  We had reservations were seated at a nice booth with a magnificent view of water outside. We started with a bottle of wine while waiting to decide what to order. Starters included the Salad and soup combination and one Caesar Salad and they were generous with the bread. So, my husband and I split the whole steamed crab and I couldn't finish my portion so he finished it for me. My brother had the mixed grill and his girlfriend had the Cioppino - both dishes were excellent. Our waitress put the entire order in at the same time so we were 1/3 of the way through our starters (salads, soups, bread, wine, etc.) when the meal came out extremely rushed. We struggled to move the dishes around because there was little room on the table with no help from the staff. They really need to watch the table to see progression or perhaps I just need to put I need to put in the starters first and then put the main dish orders later when we are \\xc2\\xbe finished with our salads.If you like seafood and want to take out of towners to have an experience with a view try this place. I am happy to return to Fog Harbor but next time I will pace the meal. The food and view is a 4 star but the service is a 2.0.", "Andrea S.": "Seafood was amazing and I highly recommend the spinach crab dip, delicious! Our server, Luis, was very kind and helpful.", "Vicky D.": "Right on the pier and fresh seafood! We got the crab and scallops risotto which wasn't overly creamy just right. The fries were good! We also got the baked oysters and garlic crab. I'd skip the crab but the risotto was solid. The clam chowder said award winning and it's was delicious! Clean and nice ambiance!", "Bryant X.": "Great location and food, very delicious and the prices are quite reasonable. One of the best value restaurants near Fisherman's Wharf! Highly recommended!", "Kashyap J.": "It was our second visit to the place. And I liked it better this time. Wife wanted to share crab with her mom during her visit and fog harbor is one of the good ones!They shared half a crab. They thought it could do away with little more seasoning but 4.5/5 for the prep including apron. They could ideally finish 1 whole Dungeness crab. I ordered patrak sole with fingerling potatoes with capers and herbed butter. It went perfectly well ( surprisingly) with light lager. 5/5. Rest of the group liked it so much we ordered one more to share!! That's rare for us. We also had lemon ginger and strawberry nojito. Overall the bill was $170 ( bruschetta,half roasted garlic butter crab, 2 sole dishes , 2 beers and 2 non alcoholic drinks)We went at 3 pm with reservation through yelp. If you want to dine in between 12-2 reserve early. ( days)We requested window seat and got one!! Thanks to reception staff. We sorted 10 sea lions lasting on pier 39. Our serving crew was polite and served with huge smile. Overall definitely going back for big meal when we plan one with dear ones!Tip- definitely ask for bread for the table. It's delicious", "Omar E.": "It's good sea food for the price. That view alone off the side windows onto the harbor takes it from a meal to an experience.Service was polite, clean and quick. No complaints.", "Jack G.": "I'm in San Francisco a lot. When I went here in April of 22, I was very pleased, but in two recent visits in March and May of 2023 I was very unimpressed - the food was mediocre at best. In March I stopped in for dinner alone at the bar. I had the chowder in bread bowl and calamari. The chowder was good, but the calamari was not good. When I went back in early May with my granddaughter, she got a chowder in bread bowl and we shared a calamari . This time the calamari was good, but the chowder was awful. Say something good - Their house draft beer is very good. Seems to me that the place has become less of a very good restaurant and more of a tourist joint - great views, right on Pier 39. When I am in the area in the future I'll stick with North Beach places and stay off the Pier area.", "Ila Y.": "BONG JOVI was a great server, super attentive and super nice, speedy service. I can't wait to come back again tomorrow! I", "Delicia J.": "OVERALLI appreciate the good service I received sitting at the bar. The bartenders were knowledge, friendly, and weren't trying to upsell you in getting something to make your bill more. FOODI got the clam chowder and sourdough rolls. I was pleasantly surprised by the taste of chowder. It wasn't bad but it wasn't anything to rave about. I think the scoop they gave me didn't have any seafood chunks in it at all. It was more soupy and less 'meat'. The flavor was good but I wish it was heartier with seafood. The sourdough rolls were amazingly delicious and served hot. That was a redeeming quality to the chowder being subpar.DRINKI got their moscow mule and it was pretty light. I think their measurements are off.HOT TIPDon't get the clam chowder in a bread bowl. Rather get a large clam chowder and you get free sourdough bread on the side and can ask for more. When you go for happy hour you have to ask for the happy hour menu as they don't readily provide it to you.", "Dorothea P.": "I was here for the Salesforce conference and we were all together a group of 14. After watchin the sunset by the seals we decided to walk up here and see if we could get a table. Good news we were able to get a table for 10. We all at a long table and made the table for 10 work for 14. it was a little tight but the good thing was that next to us there was a table of 4, about 30 mins after we were there they got up and we were able to take over the table. We ordered two bottles of wine and a couple of the people at the table go cocktails. I was not drinking as it had been a long day of traveling. We started our dinner with fresh oysters. They were delicious and you can tell that they are really fresh. We also got the tuna poke, I liked that it had fresh avocado and fresh mango at the same time. For my main course I ordered the Cioppino it was a great portion and it had a lot of fresh seafood. I absolutely loved it because it was unlike anything I have had a in my life. With the weather being a little chilly outside it was perfect. Overall, I liked this place it had a good ambience, good food, and good service. If you are thinking about going, go!", "De'Naya G.": "Went to Fog Harbor for Mother's Day and even without a reservation we were able to be seated within 30 minute near the window. There were special additions to the menu for spring. The Shrimp and jalape\\xc3\\xb1o ceviche was delicious! The drinks were great as always. My husband and I both tried new dishes which were amazing. But the best part was our server. Shawn was awesome! He was very knowledgeable, very friendly and well versed enough in the menu to make suggestions to us! All in all, a great Mother's Day celebration at Fog Harbor!", "Helen T.": "Absolutely enjoyed our time here! This was our third visit and just like the first time, the staff, food and drinks were delicious! Quianna, Kayla, Tony and Jason were all a pleasure, extremely friendly and knowledgeable of the menu items!", "Farah C.": "The restaurant is located right at pier 39. If you're able to snatch a window table, you would get to enjoy the amazing view of pier 39! Pro: Free on premise wifi Food: The bread bowl was huge! The sour bread was fresh and yummy! The clam chowder was a little thick, but flavourful. I would recommend sharing this between two people, or having it as a main!", "Tina P.": "Tasty food! Knocked me out when we went back to our hotel lol. Our server was so kind and speedy. He was courteous and thoughtful. I was surprised with how huge the restaurant was", "Todd G.": "Great atmosphere and food. The calamari was really awesome and our waiter, Luis, was incredibly helpful and fun!", "Debra S.": "Great fish house! Had the seafood trio. The wait staff was really friendly. The view awesome as well.", "David W.": "This was my second time dining here, having discovered it three years ago. My daughter had the burger and I had the salmon. Both delicious, great service, great ambience, great bread,. Would highly recommend!", "Brooke I.": "My family and I went to SF to celebrate our wedding anniversary and picked Fog Harbor Fish House for our celebration dinner. We weren't sure what to expect but hoped for some tasty eats. Our booking for the reservation was done online with a request for window seating as available.They delivered on the seating and we had a nice window view which we enjoyed.On to the food... this was not what we expected, it was beyond our expectations. Our son ordered their lobster roll that was gone as quickly as it was brought to the table, and our daughter went with their burger that was almost as big as her, she enjoyed it as well.I went with the shellfish platter which was plentiful and prepared very well, savory and fulfilling. My wife had the Garlic Roasted Whole Dungeness Crab that looked beautiful. The potatoes that came along with her dish were epic. Our entire experience there was exceptional. We will make it back to the Fog Harbor Fish House every time we are back in SF!", "Brianna W.": "This was my first visit to Fog Harbor Fish House and it did not disappoint on my birthday! Not only was the food SO delicious (we ordered the fish and chips and whole Dungeness crab) the service was even better! Our server, Mearilyn, went above and beyond to make our dinner so special. Also, the birthday dessert was so filling and yummy! Such a beautiful atmosphere over looking the water, too. We absolutely recommend coming here as we had such a great experience!", "Jess J.": "Food was delicious. Service was outstanding. Our server was Bongjovi. He was friendly and answered all our questions about the entrees. I would come back here.", "Melanie K.": "Fabulous food and wonderful ambience. The best fish and generous portions. Very good service and friendly staff. Definitely will return.", "Belgica V.": "Great dinner! We were in SF for a couple of days and we had a great time. This restaurant was great. The server was super nice and friendly. The food was delicious! We will be back!", "Betsy C.": "Amazing food and amazing staff! We drove into the city late Monday and were hoping to get a nice seafood dinner/bite to eat, and we were more than pleasantly surprised! We tried the clam chowder, SO GOOD! The baked oysters were to die for, so rich and full of flavor!I had the lobster roll which was great, but the winner of the night was the cioppino, it was so good it had my husband speechless lolThank you so much Nelson, for 10/10 service and the recommendations!", "Lauren S.": "This was one of the top places I've ever eaten. I travel to sfo for business and always try a new place when I'm out here. Fog harbor has taken the cake. I was a few minutes late as I didn't realize the entrance was only accessible by going up stairs so I ran around the first floor of the pier for some time trying to figure out how to get in. Go up the stairs and it's quite simple from there. I was seated right away with a stunning view of the pier. I was able to watch the sea lions swim and jump and it was incredible. My waiter made great wine recommendations and the scallops were perfectly cooked. I can't wait to visit again", "Pranamee S.": "Finally made it to this place. Reserved many times before but always ended up canceling due to some reason so really happy that I could go try some of their menu highlights. This place definitely has some great cocktails, I tried the tequila cocktail, paloma, mule and a spicy one that was probably my favorite. (Yeah, quick lunch turned into a long one with cheers) We tried calamari and loved it. The Oysters were great & fresh. The clam chowder was great, no bacon, no mussels (at least mine didn't have it) and good cup size. We took some to-go for our friends Fish and chips were okay. Lobster tails was okay, a bit over cooked for mine but the Whole Crab was perfect. Went there, understood the hype and now done with it!", "Dung N.": "We dined here during our trip to SF. They are located on Pier 39, so expect a lot of tourists in this area. We were able to be seated near the window and earlier than our reservation time, which was great!We started off with a bottle of Chateau Ste. Michelle Reisling and complimentary sourdough bread rolls. The rolls were so good! I ordered a clam chowder bread bowl and the chowder was very flavorful! The shellfish tower was warm, instead of the usual chilled ones I've gotten in the past. There was crab legs, clams, potatoes, shrimp, and toasted bread! It was definitely very filling for two people! For dessert, they bring out a tray with all the selections and we ended up with the tiramisu! It was so moist and yummy! Thanks Bongjovi for taking care of us!", "Tiffany F.": "Celebrated my sons 16th birthday with family. Food is delicious; we had several dishes; and they all were divine. Amazing pasta dishes; top tier seafood. The drinks are top shelf; we had several. The kids had a good variety to choose from. Highly recommended for the entire family.", "Cathy C.": "We ordered the garlic Dungeness crab. It came with green beans and fingerling potatoes. The crab, beans and potatoes were cooked well but the garlic was burnt and bitter.The service was very good.We enjoyed the view of Alcatraz from our window seats but restaurant is a bit noisy.", "Angela T.": "Came here on Sunday for a day date with the Mr. after a break in rain for what has seemed like forever and we thoroughly enjoyed ourselves. We ordered a ton of food and it was all delicious.The crab/artichoke dip was drool worthy, clam chowder was on point, and the mussels and fries could never be a mistake! For our entrees we did the Scallop/Crab Risotto and the Fish and Chips, both were delicious. Our waitress Allison was super personable and very attentive. She seemed to be on top of it with all her tables talking to everyone and a good attitude which always makes the experience that much better. Definitely will be back and can't wait.", "wendy q.": "Probably some of the best clam chowder in town! Beautiful views if you snag a window seat with fresh chowder. The cioppino is also solid as is the calamari.Pro tip: check the Yelp waitlist before heading over to get on the list.", "Aj E.": "delicious food. beautiful scenery. Luis gave us great service. try this place out if you're in town.", "Michelle B.": "Yes it's in a ridiculously touristy part in SF. But if you are a local wanting to go to Pier 39 for any reason (sea lions?) or a tourist wanting to eat at a delicious sustainable seafood restaurant with a nice water view, this is your place. I've had great meals every time I've been here and would recommend. Reservations highly recommended and request that water view!", "David N.": "Good food, quick service, beautiful view of the pier and water. I visited Fog harbor on a Monday noon around 11am. We were seated immediately as it wasn't busy that time. I went ahead and ordered the 1/2 dozen of oysters, fried calamari for appetizers. Classic Arnold Palmer for drink. For entree I went ahead and ordered the seafood platter which includes linguini, crab, clams, shrimp, and mussels saut\\xc3\\xa9ed in a rich buttery sauce. This platter comes in either a one person option for around $44 or 2 person for around $88. The platter was a bit on the salty side, I think they can use a little less butter as it tasted a bit overwhelming, however the seafood was well cooked, good texture, oysters were wonderful. I wish they still had the sizzling platter of seafood like shown in the pictures here. I would come back again when I'm in the area.", "Anna S.": "I truly love this restaurant. For its location, as a local it is hard to find restaurants that are truly worth the price of admission. It is a showstopper and definite place to stop at when entertaining the out of towners, without that sense of being robbed.The prices are not cheap but nothing on the wharf is. In fact, these days, nowhere in town has cheap crab and if you do find that, then run. The crab and lobster are definitely the main items to come here for.I came for brunch recently with my friend and I tried to be modest, so I ordered the steamed clam appetizer and a house salad. Neither disappointed; the clams had great flavor and were a huge portion. The house sourdough rolls pair wonderfully with the sauce for dunking. The views are incomparable. Service was so fantastic, such a sweetheart of a waiter. The salad was fresh and well-dressed.However, I should have just ordered the garlic roasted crab. I realized this when I stared so intensely at the guy near us eating his crab that his girlfriend thought I was preying on his young ass. Nope; I just wanted to eat his meal. So, if you come here, don't try to cheap out and just order the crab. You know you walked there for crab.Of all the gin joints on this side of town, here's looking at you, kid. I like everything about them-- but know there will be a wait and price point.", "MK R.": "Seated earlier than expected, and had a view of the bay. We could even see Alcatraz from our table. Lovely service from all staff we encountered. We started with a glass of Prosecco and a lager. Both satisfactory. We had the blue cheese garlic bread for an appetizer which I loved but my partner thought was a little too strong. She's never been a big blue cheese fan, though. For our entree, we shared the cod as neither of us were super hungry. It blew us away. Perfectly cooked. Great seasonings. Ideal temperature. The beans complimented it well. Great experience at Fog Harbor!", "Larry Z.": "Service by Arif was excellent as was the food. Nice ambiance. Strongly recommend. Clam chowder was exceptional, everything very good!", "Aly A.": "Food / service were excellent !! Atmosphere was very good as well. Highly recommend clam chowder !!", "Mike G.": "After a giants game we walked to the pier has no idea of where to eat I'm so happy we came here !! The food was delicious nice views also, I have a shellfish allergy and they took care of me !!", "Sophia H.": "As of March 2023 the boat is showing signs of aging. Great views of the city, you get to go right under the Golden gate Bridge, you sell around Alcatraz, there is a pre-recorded narrator talking about things. It's worth checking this out especially if you get city pass.", "Armin S.": "Location was perfect, great view, awesome service, food taste was good. Price was not very high", "Jaclyn L.": "The clam chowder was pretty good. The sourdough rolls were yummy. My dad got the fish and chips and they were really good. Prices were a little steep, but that's to be expected in a touristy spot. The view was beautiful too", "Sara K.": "Luis was amazing. Liked how he came with recommendations. Was always there to fill our glasses. Food has amazing taste. Atmosphere is eclectic. Come as you are.", "Annie V.": "Oooo Yessss Honey!! This is the place to dine if you're in SF!! I fell in love with this restaurant on my first visit, I've dined at other places on SF, but this place by far is my number one, and not my side piece!! Great service, the food is mouth watering tasty!! Wow, the view is breathtaking, you get a beautiful view from every window, with a lovely sunset if you're there for dinner!! Stop yelping, and go check this place out!! You're welcome!!!", "Melissa S.": "The highlight of my trip to San Fran! Those mussels are yum!", "Henry S.": "You would think this is a tourist trap but Fog Harbor is actually decently priced, the food is good, the services is great and is in a great location. Being a bay area native I was skeptical when I saw the high marks but after trying it, it lives up to the 5 star reviews. Our waiter Luis was spot on with timely service - refilling our waters, keeping us updated on the status of our food and always had a smile. He was so kind and friendly to our kids as well.The food is delicious here! You can see the chefs preparing everything out side the through the windows and they are so talented. The scallop risotto was 5/5 and the my kids loved the calamari appetizers. The oysters are fresh and even the dessert was great (we got the apple crisp). Highly recommend this spot for lunch or dinner!", "Jenny C.": "We got the clam chowder,cioppino, and risotto. Great food, nice ambiance, would really recommend if you are touring here around Pier 39. Special thanks to our server, Bongjovi, for making our visit even more enjoyable:))", "Annette B.": "Husband and I both got the clam chowder in bread bowl with side salad. Clam chowder was excellent, Caesar salad had excellent flavor, but was drenched in dressing so left uneaten. Service was excellent. So many clam chowder options on Fisherman's wharf, this one will not disappoint!", "Juan R.": "Food was great, ordered the Garlic Crab; slightly disappointed that they pre-gutted the body of the crab. Service was awesome; however, they never opened the window when asked - it became pretty hot once the place became full. Dessert was delicious!", "AJ P.": "Decent enough food but watch out for the extra 5% tax they sneak onto the bill without telling you. It's a SF City tax that they actually are not enforced to adding onAre the employees really benefitting from this, as this tax is notoriously added with that explanation without having to provide proof. Most just use this to increase their margins without having to increase food prices on menu.I'm ok paying these providing the server is up front about the charge and explains itOurs did not until after I had tipped 20%I hate being caught in theseHence the review", "India H.": "Maaaan!!!! Let me tell you a lil something about Fog Harbor. No matter what you order the presentation, taste, service and serving size is above and beyond another restaurant on Pier 39. I usually visit San Francisco twice a year and this is my go to without question. I baked oysters as an appetizer, a 5oz glass of Rose' and the Scallops and Crab Risotto , MOUTH WATERING GOODNESS", "Marissa H.": "I had an incredible experience here!! I RSVPed for the waitlist on Yelp and was able to get a table right by the pier that overlooked the bay and Golden Gate Bridge. It was so easy! I loved the complimentary sourdough bread that they served -- it is warm and soft inside but crispy and hard on the outside. The textures were phenomenal and it was delicious. The butter is also whipped and very soft! I got the lobster tail and it was cooked really well so it wasn't hard or stringy. The mashed potatoes slapped !! Sooo good! I DIDNT like the green beans / broccoli though. It was sour and so hard. Also you can get pier 39 parking validation if you show it to a worker.", "Tea V.": "I've been to San Francisco numerous times, and each time I tend to usually stray away from the more touristy spots such as Pier 39 and their restaurants. However, I decided to play tourist for a day with my friends and it was so fun! I got to try out one of the top 5 restaurants at Pier 39! We asked for outdoor seating and were led to a private patio area where our table was right next to a wonderful view of the ocean. NY Steak ($38) Includes Creekstone Farms steak, topped with peppercorn sauce, garlic mashed potatoes and sauteed spinach! Wow oh wow! I want to start off by saying that these mashed potatoes were so buttery and soft! It basically melts in your mouth and the garlic flavor is really prominent but it still tasted amazing! The steak itself was a perfect medium rare! I was not a huge fan of the peppercorn sauce, but it wasn't completely bad. Overall, I tried other items off their menu such as their crab cakes (which were amazing btw), clam chowder (award winning for a reason!), and the calamari (super crispy and delicious!). I had a great time and the food was amazing! Definitely check it out if you are ever at Pier 39!", "Malikah M.": "Any place with over 9,000 reviews gets a visit from me. Hubby and I are visiting and decided to stop in for dinner. It was busy on Sunday night but the bar was wide open to dinner. We sat down right away. We had to order their award winning clam chowder with crab meat in a sourdough bowl. I wish I could say it was amazing but I think it need both salt and pepper and the bowl and crab meat cooled down the soup and it wasn't hot enough for me liking. Now for the good part, the rest of the food was amazing! Very fresh and flavorful. I order the 1-serving grilled seafood with rock crab, shrimp, mussels, and clams over garlic butter pasta. That was delicious and the portion is so large my husband had to help. He had the fried calamari which was seasoned perfectly. He didn't like the fried jalape\\xc3\\xb1os but I LOVED them.", "Bre T.": "Bongjovi was an amazing waiter! Gave us great service and made us laugh. The food was amazing! The display and taste were superb.", "Rachel M.": "My ladies and I were having one of our Sunday splurge days. We had just gone to Pearl spa for Korean scrubs and wanted to dive into some delicious, fresh seafood.Location is on touristy Pier 39 but if you park in the nearby garage you get 1 hour of free validation. From the 3rd floor, there's a bridge that connects you to the restaurant.As usual, it's bustling around the area so reservations are a must, especially for the weekend. We got a table for 4 in a booth that overlooked the harbor and the GG bridge- it was gorgeous! Our server very promptly took our order and provided great service, even taking our pics upon request. We ordered several drinks - one of them was orange had tasted like dessert! Food-wise, we got a tasty variety.-Oysters - small and fresh-Clam chowder- creamy with fresh clams -Calamari- I expected it to be better with better quality calamari and more of it.-Mussels and frites - these were bomb, tender big mussels and the fries are crispy and flavorful.-Shrimp avocado salad - my favorite! Fresh ingredients and ample amount of huge grilled prawns, bacon, avocado, and a tasty dressing.-Cioppino- fresh seafood, rich tomato sauce -Crab roll - friend reported it was delicious and had lots of fresh crab-Scallop and shrimp risotto- cheesy basil goodness with fresh seafood- really tasty.-Flourless chocolate cake with vanilla ice cream- just the right amount of decadence to end the meal.We thoroughly enjoyed our delicious seafood splurge and didn't have any room for dinner that night so I'd say it was worth it!", "PJ S.": "The food was 5 stars. We ordered clam chowder, pasta for my kid (who loves it), and a shellfish platter. Trianna was an amazing server and even asked for food allergies - which we do have. Restaurants should be asking that. They accommodated us with corner table seating because of our dog. However, we lost Trianna, without letting us know, and replaced her with an Indian lady. She was okay but she started preaching to us about our service dog and that we should not let her lick the corner/edge of the table. We told her that our dog did not but she said just in case and to not let her. Then everything went downhill. We got upset and she started patronizing us and even put her mask down and got closer to one of us when she was speaking. Overall, it's a good restaurant but we just had a so-so server.", "Marisa M.": "Our server Bongjovi made our whole experience worth it. He was so nice and very attentive. If we were to come back, it would be for the service and the viewWe ordered the following:- Ahi Tuna: 7/10- Clam Chowder: 9/10- Harbor Burger: 6/10- Lobster Roll: 7/10- Server: 10/10- View: Priceless", "Darci W.": "We came here a year ago, and it was one of the most delicious meals I had ever had. So of course it was top of our list to come back to. I actually came here two nights in a row -- once when I had the night to myself and once for dinner with my husband. When I came on my own, I sat at the bar and ordered the cioppino. It was absolutely delicious! I would've given 5 stars based just on that visit, but we did have some minor issues the following night.I ordered the exact same thing I did a year ago -- mussels & fries and twin lobster tails. It was all good, but not the \"OMG, this is the best lobster I've ever had in my life!\" experience it had been the year before. We were at a very small table with barely enough room for both our plates and drinks. So it was especially annoying that our main dishes were brought out when we were only about halfway through the appetizer. That's a big pet peeve of mine anyway, but there was nowhere to put all this food on the tiny table, so we had to put our drinks & appetizer plates in the window sill, and the table was still completely cramped. Then our wine came, and the ice bucket also had to go on the table because they don't have ice bucket stands. There was either a leak in the bucket, or just crazy amounts of condensation because a huge puddle formed on the table and got my husband's arm wet. We had to use both our napkins and ask for extras just to keep the puddle from spilling into his lap over the course of the meal. So, I have to say Fog Harbor is not quite as good as it was a year ago, but it's still one of the best seafood places in the area, and I would certainly come back for that cioppino!", "Jasmine M.": "This dinner was SO good. We started at the bar while waiting for our table. I ordered the \"Lipstick Lemondrop,\" which was delicious. They note on the drink menu that the cocktails are made with \"real fruit and fresh squeezed juices,\" and it really made a difference in the lemon drop -- so much better than the fake drink mix stuff. But knowing the care they put into freshly crafted drinks, it was pretty disappointing that the side of broccoli with dinner was clearly frozen bagged veggie mix. It tasted completely bland and watery, which is a shame because I love fresh broccoli, but this broccoli was not good at all. Frozen broccoli mix was the only disappointment of the night. Everything else was phenomenally good, and I hate that I can't give this place 5 stars, but frozen veggies (or anything I can make just as well on my own in a microwave) is not ok with me. We ordered the Mussel Fries as an appetizer, and they were delicious -- perfectly cooked mussels, perfectly crispy fries, and a delicious broth. I ordered the twin lobster tails for dinner, which were some of the best I've ever had and a bargain at $53. I finished off the meal with the Vanilla Bean Creme Br\\xc3\\xbbl\\xc3\\xa9e, which was very good.We had a great table by the window and really enjoyed the view of Alcatraz. It was sort of like dinner and a show watching the sea lions swimming by!The service was impeccable. Jane is the best! She's exactly what you want from a server -- there when you need her, but never intrusive and genuinely friendly, not phony friendly for tips, like some. This restaurant will be top of my list to come back to the next time I'm in San Francisco.", "Dan D.": "With above average bar service, a pleasant dining room with a backdrop of the Bay, and better food and drink than you'd expect of its tourist trap location, I would recommend Fog Harbor as a first- or last-night-in-San-Francisco restaurant that's great for contemplating what's to come or what's transpired over the trip.I went simple, ordering a sourdough bread bowl and a Woodford Reserve Old Fashioned (the bartender was schooled enough to ask me what whiskey I wanted). The Old Fashioned was perhaps a bit sweet, but well made; and the chowder good enough, but probably in need of more brine. I did wish the sourdough had more tang, since San Francisco is supposed to be one of this bread's bastions.I appreciated that I got sat right away and that the food was a step above that which you'd expect from a place that could easily be a tourist trap.", "Manny D.": "The best! From the moment you walk in you are greeted like family! The staff is awesome, very respectful and friendly. Our server Arif and his assistant did an amazing job explaining things on the menu and giving recommendations. I ordered the shellfish platter, and clam chowder. I'm going to start by saying the clam chowder is superb! The best I every had and highly recommend. The Shellfish Platter has everything anyone looking to try amazing seafood can get. The crab, muscles, clams and shrimp are perfectly seasoned and delicious! They validate parking so make sure to ask. Amazing!! This is a must visit when in San Francisco.", "Ashley H.": "My boyfriend wanted to take me somewhere a little special on our SF trip so we decided to come here. Wait time wasn't too bad, I recommend hopping on the Yelp waitlist if you can. However, when we were seated, it took a while for any server to really greet us and take our order. We were so confused who was supposed to be taking care of us until a gentleman came forward and told us our original server either went on lunch or went home...but anyways, we first ordered drinks. My boyfriend ordered a glass of wine but our server mixed up the wrong one and eventually gave us the correct one. Then we ordered their award winning Clam Chowder in the Bread Bowl of course, Fish & Chips, and the Linguine & Clams Pasta. All of the food came out in a timely fashion. Can't go wrong with clam chowder by the pier. Fish & chips were crispy and delicious. And the pasta was divine too. Overall a nice, intimate place to have dinner but service could definitely improve.", "Stephanie R.": "Food: 2/5 Service: 5/5 Free bread: 3/5 Free butter: 5/5Free water: 2/5 Food wasn't that great and I wouldn't come back here again. This place is only popular because it's on the pier. I do like how I can join waitlist on Yelp....that is one plus.", "Warisa T.": "We came here for late Valentine. We enjoyed the delicious food and service was excellent, especially Amy :)", "Karen C.": "Reading all the good reviews for the food here set me up for disappointment when I tried mine. I got the clam chowder and clam pasta and neither were great. The clam chowder was oddly sweet which was off-putting and the clam pasta lacked that umami, seafood-y flavor. My mom and I originally planned on getting one each but we were glad we split one instead because neither of us were wowed. The portions were decent which would've been more of a pro if the food were up to par. My favorite part of our meal was the house salad... at a seafood restaurant. Yikes.The waitlist experience was needlessly stressful and is the biggest reason I'll never come back. They use Yelp for their waitlisting system and I joined when the estimated seating time was 5pm so that I'd be, presumably, seated at 5pm. The waitlist then jumped me to the start of the queue at 4:30 even with 20+ other parties in line and I asked the host if I could just wait until 5, to which they said no, I'd have to leave and rejoin the queue. That was fine with us even though it meant a new estimated seating of 5:30. The waiting area is so crowded and loud all the time that it's hard to hear the host(s) calling names so I relied on the app. When it said my party was up, I went to the host line to check in and they removed my party in the time I was waiting... saying that I took too long to check in by waiting in line? I asked them what was I supposed to do, skip the line? I got in line the second the app told me I was up. They clammed up and just said they were calling people (amidst the noise I mentioned earlier) so I made sure to awkwardly squeeze myself in this crowd of strangers close by to hear them since their system is awful.", "Afshin A.": "Delicious Sea Food!We live in the neighborhood and not very often wonder onto Pier 39 during the busy time. After all it is a very popular tourist attraction and can get way too crowded for our liking (i.e. long lines for everything!). Well, on this cold and quiet midweek day in January as we were taking a walk around the Pier, we decided to give Fog Harbor a try again. It had been a long time since our last visit, we were hungry for sea food and there was no line!We started with a couple of beers and Crispy Calamari. The calamari was fresh, delicious and perfectly done! We then switched to Crab Cakes; scored again! They were awesome! They were two on the order and I could have had them both if I was allowed to do so!!We then decided to have our main course and I opted for Cioppino. A wise decision, I thought! Why, because I assumed no one would want to share it with me and I could have it all by myself, wrong! The Cioppino was shared two ways and we both enjoyed it immensely. Our server, a young man whose name I do not recall, was very attentive and good at his work. We had a very positive and enjoyable dining experience.", "Rare R.": "Touristy location, but awesome food!Fog Harbor Fish House is located in one of the most touristy locations in San Francisco. In most cases that would be a warning sign, but they break the norm. The quality of the food and the service is very good, and their prices are very reasonable! Imagine that!Although I live only a few blocks away, this was my first time eating here and I was very disappointed ....... in me for not having come here sooner! We tried the Mussel Fries and Crispy Lemon Calamari for appetizers; both done really well, especially the mussels. then had the Grilled salmon for main course. It was served on a bed of roasted corn, arugula,red peppers, fingerling potatoes and tarragon with a citrus butter. Excellent! The desserts looked very inviting, but it was late and we were all full, so that we left for another day!", "Kimberly B.": "Located right on the Pier. While in town on a business trip we decided to dine here. It was a Monday night and very busy. Our reservation was at 8:45 pm. We arrived and were promptly seated.Our seat was right by the window, luckily our timing was perfect and we captured the sunset. The waiter was very courteous. We ordered the garlic shrimp and calamari and our starters. My husband loved the spicy shrimp but I wasn't really sold. It had a funny aftertaste I wasn't fond of. The calamari was yummy though, I guess it was a balance.For entrees I ordered the scallops with crab meat while my husband chose the filet. He loved his steak. The scallops was very undercooked to me. They felt very soft to taste and anyone who says scallops knows there very bland without proper seasoning. I am comparing honestly comparing to Maestro scallops which are better in my opinion.For dessert we tasted fudge cake which they displayed on a tray. It seemed as they showed all deserts on a tray for guest guest to choose from. We added cappuccinos and we're satisfied.", "Vincent F.": "If your craving delicious Clam Chowder and decadent Crab. You'll know you've reached the correct restaurant when you enter Fog Harbor on Fisherman's wharf. My boyfriend and I both ordered the Award winning clam chowder in a delicious Sourdough Bread bowl. To start our meal which was rich and creamy with a lot of clams, the seasonings were a perfect blend. I would highly recommend starting your meal with the chowder. Then we shared the Shellfish Tower and swapped out the raw oysters for the Baked oysters that were cooked in a creamy Parmesan sauce. Absolute perfection was achieved when their chef made these. The Seafood on the platter was fresh and the crab so sweet and delicious that there was no need for butter. If your craving seafood and your in San Francisco. I highly recommend eating here.", "Victoria P.": "With the overwhelming number of positive reviews and the hour long wait, this seemed like the SPOT to visit on Pier 39. We were recommended this by our concierge as well!Once we were seated, we waited a little longer than you'd like for a busy restaurant. We started looking around wondering if people forgot about us.. but our server who arrived was so sweet and pleasant, so that made up for it.The complimentary bread was delicious and an especially good pairing with their \"famous\" clam chowder. I had high hopes as all the trays of food went past.Our table ordered the Sole, Seafood Penne, and two orders of the Scallop & Crab Risotto. The sole was exceptional, my dad described the penne as \"very good\" and my mom loved the risotto. I also ordered the risotto but didn't have the same luck. My scallops were slightly over cooked and weren't cleaned very well... I had sand with almost every bite. The crab risotto itself was delicious, but for $40 I had better hope for the scallops.Overall, it was our first meal in SanFran. A pretty good start to the trip!", "Tim W.": "First of all I am shock it got 9,000 reviews and 4 stars?! My first time there and probably my last time. The food wasn't that great. I order the Caesar crab salad let me tell you it was dry. Probably wasn't a good idea to order their pasta was just plain. The only thing was good was the view from our seat by the window. The service was ok as we never got more break and refill of our drink...For the price of the food I expect much higher quality food and taste!", "L L.": "I really enjoyed the clam chowder bowl with crab meat. It's was not loaded with potatoes like a lot of other places. I had the mixed grill (salmon, pacific cod, skewer of shrimp, garlic mash, and grilled asparagus, yum. Try the chocolate banana cake w/ice cream. It was delish, and the blonde w/ice cream.I was not excited with the calamari, a little dry, and I've had better. Lobster tails, delish, and cooked perfectly, Oyster too. Good mixed drinks.Rachel was our server, and she was fantastic; very accommodating and kind.This restaurant was crowded. You still get a view regardless, and there is outside diningGive this place a try.", "Nayeli M.": "Seafood is very fresh. Clam chowder was delish. I ordered the 2 lobster tail plate served with green beans and garlic mash potatoes. Lobster was fresh and sweet. Tails were 4-5 oz each, small but delish. They make their iwn sour dough bread and it's served warm, yum. Overall, I enjoyed my experience here. Noisy at times.", "Jordi P.": "Food was really good. I really recommend the fish and chips. Our waiter was Bongjovi and he was really nice and the service was amazing. The view was amazing. Would definitely come back. Thank you for the experience Bonjovi and for my birthday treat!!!", "Jon L.": "Before you go, understand this is a fine dining, expensive experience!!It was so nice to see managers working with their staff to provide an experience guests will never forget. I over heard one of the employees ask a solo diner if she had a safe route home since she had been drinking. The level of care for their customers is so outstanding! Although it is expensive, it is extremely worth it.", "Matthew L.": "Very much enjoyed the food and service. Outdoor seating was nice, has plexiglass to block the strong winds.", "Dianna S.": "Fog Harbor is located right on Pier 39, but it's better than a typical tourist trap. I had reservations and was seated promptly. There were quite a few people waiting outside, so I definitely recommend making reservations in advance. The restaurant has excellent views of the water. The garlic roasted Dungeness crab was pretty good. The crab tasted fresh, and it was very flavorful. It came with some steamed veggies and potatoes that complemented the meal well. I also ordered the clam chowder in a bread bowl. Their clam chowder was great and thick. Compared to other clam chowders, this one had a little more bacon flavor to it. I particularly enjoyed it, but some people in my party weren't a fan of the bacon flavor. One negative is that the service was bad, and I struggled to find my waiter for a while. She maybe had too many tables as the restaurant was definitely packed.", "James L.": "First restaurant of our week long San Francisco vacation - and I have to say: Good choice! My husband and I really enjoyed our meal. It was the perfect start to a fantastic trip. We didn't want to overeat because we had a large dinner planned. So we skipped the appetizers, which I always hate doing at new-to-me restaurants. I just want to try everything!I chose the Shrimp Brochette, which was very, very good! Deliciously seasoned shrimp, 12 of them on skewers. Excellent flavor! Served with mashed potatoes and saut\\xc3\\xa9ed green beans and peppers. Super yummy; very happy with this one.My husband got the Cioppino, and he LOVED it. Shrimp, clams, mussels, crab, and white fish in a tomato saffron broth. Very hearty, with a wonderful warmth that makes you feel so cozy, comfy. Personally, I prefer cozy, comfy over anything I'd ever want to eat. So satisfying. Like a hug to the soul.Service was good, too. Food came out pretty quickly. Plus, you get nice views of Alcatraz, a bonus!", "Asia C.": "I thought the pictures looked good and went to try it out. The restaurant was unbearably hot inside. The shellfish platter was swimming in so much butter and chunks of garlic. How do you do that to your own platter? Extremely disappointing. My wife's risotto was good at least.", "Tara B.": "Always a must when we come to San Fran! Amazing oysters and great service! Be ready to wait in line on the weekends, but well worth it for very fresh oysters and seafood that hit the spot. Did the bar mix flight and the bourbon chipotle shooters and walked away happy! We will be back again next time.", "Greg L.": "Great seafood. A little pricy but the views are great!You won't be disappointed. Make sure to dress appropriately if you are outside on the patio.", "Haley M.": "Took my family here for a surprise and delight celebratory meal while we were in the city. When I tell you, one of the most beautiful experiences we have had in awhile... this was it! The food was amazing, the service was amazing, and the views were spectacular. Will 100% go again, any time we are in the area.", "Oscar C.": "You cannot place orders to-go. This is ridiculous; I've never encountered this at any restaurant in my life. Completely asinine.", "Melissa B.": "Wonderful all around! Great location in Pier 39, incredible food, service and touch of class! If you're lucky enough to be seated in the back with full views of the docks and sea lions do it! We were able to warm up with amazing chowder bowls while watching the power of wills between dock workers and incredibly sly sea lions (they aren't supposed to be on the boat docks because they damage them. Don't worry, they have a whole designated section built just for them). One playful giant was full of sass and kept getting pushed off by workers to just jump on the next one. Over and over. It was hilarious). Can be a little spendy but worth the splurge!", "Sareena Z.": "Our server Evelyn made my birthday lunch a wonderful experience. Food was so fresh and tasty! She recommended her favorite cocktails which I ordered. Seating outdoors with great weather made the experience even better. Wait time was only 5 minutes which was good on a busy Saturday. Would come again!", "Katelynn A.": "Yum! Honestly the service was amazing! Bongjovi, thank you!! This plate was a little too buttery but the clam chowder was 10/10.", "Karen T.": "I had lunch here today, and was it ever delicious! The chowder was thick, creamy, and perfectly seasoned. The view from my table was perfect, on a perfect day on the wharf. There was no wait to be seated. If the rest of their menu is even close to being as tasty as the chowder, this venue could be a home run! You can't miss it, being it's at the entrance to Pier 39. A great place to stop while strolling the wharf!", "Richard K.": "Fog Harbor is at Pier 39 and while, as would be expected offers a wide selection of fresh seafood, it has an many non seafood offerings. It's waitstaff is well trained and very welcoming. Our waitress, Rachel, was friendly and very efficient. She would be a very welcome addition to any restaurant's staff, as would Jason and the other bartenders who serve a busy bar. The only suggestion I can make is that the restaurant consider giving consideration to improving the seasoning of its food. I was there for lunch and had the Lobster Roll. While it contained a generous amount of lobster and an excellent toasted roll, the filling was on the dry side and had little, if any seasoning.The location is hard to beat, right on the water with the sound of barking sea lions. Ample parking is available and the $20 parking charge is offset by the $10 credit provided by the restaurant.", "Melissa L.": "Everything was wonderful from the hosts, to the bartenders to our lovely server Luis. Everyone was professional and the seafood was cooked perfectly. The best part (besides the amazing view) was the blondie a la mode. Save room for dessert!", "Jason Marc D.": "It's my second time here and didn't disappoint. The taste and quality is still the same. I had the clam chowder, baked mussels, calamari and fresh mussels. Bong Jovi, our server is very are attentive and offered excellent customer service. This is my spot when I'm visiting Fisherman's Wharf.", "Cheryl K.": "Excellent food! We held a luncheon for 16 people and the service and food was great! Would definitely recommend.", "Christopher M.": "Loved the food, always stop n get some when we go fishing ! And will keep coming back, as long as you are there !", "Alexandra H.": "Great Seafood Restaurant overlooking the water. The food was delicious and light for a hot summer day and the view was gorgeous. My boyfriend got the Dungeon Crab and he loved it! I had the Shrimp and Avocado Salad and it was great! Both where suggestions from our waiter. If you are around the Wharf highly recommend stopping by just make sure you sit outside for the view!!", "Fernando F.": "Ok, FOG HOUSE CAN GET IT FOR SURE!!For context, I came here a few weeks back for a date night during San Francisco's Restaurant Week. I had done my due diligence in making sure that the Waitlist was on and that I could sense check how long before the time I wanted to arrive I should come back onto the app to check the Waitlist. (~45 mins was my time). (Add'l context: I waited till the last minute and didn't get a reservation)When I checked later that evening, closer to 7, the Waitlist was closed. I called the restaurant and they said that they closed it, but were still taking people until 9! (As such, don't panic like I did). When we got there, they allowed for us to add our names to the Waitlist. The wait was 30 mins so we walked the pier at night, great time.Returned back soon after the 30 mins and had a great seat. It was actually pretty full with few tables even remaining. We got sat at 9:02 and missed out on a chance for SF Restaurant Week. That was sad, but worked to our advantage.We ended up getting several things:1) Red Chili Garlic Shrimp: WOW! If I can take a sauce, put it in a bowl and just take it home with me, it would be this! I could not stop almost drinking this sauce, it was that good. Everything about this was great: the shrimp was well cooked, the sauce again was just wow.2) Crab Cakes: I had been looking for crab cakes that would stand the test of time and while small (unfortunately), it tasted fresh adn that Cajun remoulade below was actually chef's kiss.3) Salmon: Delicious, fresh and a great portion size to go along for the meal. It was well done and the sides on that were also tasty.4) Fish and Chips: I could not stop eating them. (Well, I did because there was literally no room left in my stomach.) However, it was crispy, the dish was overall well executed.Y'all can have my money any day of the week! From service to attention to food quality, it was all truly deserving of 5 stars", "Rick R.": "What more can you say than \"Wow\". I've enjoyed Fog Harbor more than a few times and it's been consistently great. The service is not distracting, I wish I could remember my servers name, he was fantastic to have. Each time I've eaten here I've had to have the clam chowder. I'm a big foodie and can become a big food snob when a restaurant has a claim that their food is the best or maybe they've received a prominent review. In this case the positive praise is for real. Yes they are on the pier which can seem as a tourist trap but it's not that way here. At the Fog Harbor they have some of the best clam chowder I've had anywhere, it's really good! I really like that it's on the pier as it adds to the whole dining experience with the harbor views. I'm excited to come back when I can to enjoy the great food experience here.", "Robert V.": "Sunday's are great days for family time, especially when you're celebrating a birthday. Hopefully your party's a little smaller than ours since we had to be seated outside on a windy day. We arrived at 2 since that's what we had for our reservation and we had to wait an additional 30 minutes since they didn't have our table ready. So I guess if you're coming here make sure to arrive a bit earlier. Looking over their menu it wasn't too bad since food is on one side and drinks are on the other. To start off with drinks I ordered the Alcatraz Escape and it was to my liking as had some sweetness to it with that rum base. As for appetizers we grabbed the Crispy Calamari and Ahi Tuna Poke. The Crispy Calamari was a hit for my family and we ended up ordering 3 more orders of it. However the Ahi Tuna Poke was more on the smaller side of appetizers. Main Dish: I know coming here I should've ordered a seafood entree, but I ended up getting the Pesto Chicken Pasta and it was just your typical dish. Nothing from their dish really stood out, besides being very light and refreshing. I had also snuck a couple bites of my sisters clam chowder and it was also what I expected it to taste like. Wish I had saved some bread to dip it into. Dessert: Honestly so impressed by their dessert menu, they had an actually tray filled with what they have to offer and that was the most unique experience I've seen. Not sure if they were real or display models but that helped us decide what we wanted right away.Also shout out to our sever who made things lively and enjoyable during our lunch. He also mentioned that our parking was available for validation so keep that in mind!", "Nick N.": "Came here for lunch and had a great experience. We were seated right next to the window with a great view of the water. We ordered clam chowder bread bowls, fish and chips, blue cheese garlic bread, seared scallops with crab risotto. Everything was delicious, I just wish we ordered something raw. The clam chowder was homemade but the bread bowl was a bit soggy and disappointing for SF sourdough. The fish and chips were extremely fresh with a tasty horseradish cole slaw. Needed more than 2 pieces though. The seared scallops and crab risotto was my favorite. Great atmosphere and food to match. 9/10", "Wendy N.": "The reviews were great, but honestly i felt it was just ok. Seemed like a typical tourist spot were the food was mediocre. The service was ok, not great, but not the worst. The bread was very good. I ordered the muscle fries. They had a sweet Vidalia onion flavor. No need for fries bc they were soggy wo much flavor. My boyfriend ordered a pesto chicken pasta and it was again mediocre.", "Sharon H.": "After spending some time down at the Pier. We decided to stop for lunch. This was a great spot. First the view is really nice as we were sitting by the window and able to look right out to the pier. The staff provided really good service. All 3 of us loved our food and were satisfied overall. Would visit here again when San Francisco. Until next review Kisses", "Omotayo W.": "This place is definitely a tourist grab, masquerading as a high end restaurant. Waiter was quite busy but dismissive. Drinks were expensive, but made with coyingly sweet cheap syrups. My friends favorite food is crab. She asked for a recommendation and the server kept saying everything was equally as good. It wasn't as flavorful as she was expecting for Cajun. My steak -_- was so bad. I asked for medium, it came out charbroiled hockey puck over cooked. I showed the manager and he took it back. They brought a new one. It was so rare it moo'd at me. I was over it at that point. They comped it but overall it was so disappointing.We were in last Thursday, 23rd at 730pm", "Stefannie G.": "Not only does this place have such great views of the Golden Gate Bridge, Pier 39, and Alcatraz- the clam chowder is phenomena!! Jalepeno strawberry margarita is the way to go. Luis was such a friendly and kind host, who gave some great recommendation of things to do in the area.", "Guillermo M.": "Great seafood. Great environment. Super fast service and tasty sauces. I love their fried options the most.", "Shelly L.": "Classy place even though it's located in the biggest tourist trap in SF pier 39. Food is great. Why did they remove the seafood tower from the menu?! Make a reservation or wait a very long time behind tourists. Park in garage across the street and take the skywalk straight to the restaurant from the garage they validate parking!", "Marissa P.": "The seafood was so fresh and delicious! It's right on the harbor which is a nice view while you are eating. It is expensive but that is to be expected since it's a seafood restaurant! the staff was really nice! I would love to go back to San Fran to try other restaurants and return to this one! Happy eating!", "Sarah Ang\\xc3\\xa9lique A.": "Went to this spot for our anniversary and really enjoyed it! The food is amazing, I can really recommend the bruschetta, lobster roll and the clam chowder! The BlackBerry Mock tail was really good as well! Our server Arif was amazing! Really kind person and great service!", "Prithi D.": "This place is located on Pier 39, in the heart of tourist heaven LOL. We were coming because so many people had told us this is THE place for clam chowder (and they were right). We got to the area early and actually really enjoyed walking around the cute little shops and enjoying views of the bay. Highly recommend reservations as the place was packed around 5:30 on a Thursday and there were plenty of people waiting too.Our server Luis was personable and informative. We went with his recommendations and all were absolutely spot on. Cup of clam chowder to start and share. The two complimentary rolls/butter made this one of the best appetizers we've had! For our meals we went with the Cioppino and Scallops/Crab Risotto. The Cioppino had plenty of seafood in a flavorful tomato broth. The Risotto was creamy without being heavy and the stewed tomatoes just took it up a notch. Dessert was another recommendation from Luis which was the warm chocolate cake with whip cream. We shared but honestly, we could have both finished one on our own!! Wonderful dining experience.", "Kimberly C.": "Food was delicious!Scallop & crab risotto was our favorite Thank you bong kogi for your excellent service!!", "Ghazal G.": "This was such a great place to end our day trip to San Fran at. The clam chowder was so delicious I wanted to order more but I was too stuffed! It was creamy and perfectly seasoned, the crab I asked for on top was delicious and fresh. Our waitress Jazz stated that everything they serve is fresh from the morning catch, and it definitely tasted that way! Everything we ordered and ate was made perfectly and it was a great experience. Our waitress Jazz was super attentive and friendly, and she was rockin some cute earrings too! Can't wait to go back", "Francine L.": "This was such a great place to end our day trip to San Fran at. The clam chowder was so delicious I wanted to order more but I was too stuffed! It was creamy and perfectly seasoned, the crab I asked for on top was delicious and fresh. Our waitress Jazz stated that everything they serve is fresh from the morning catch, and it definitely tasted that way! Everything we ordered and ate was made perfectly and it was a great experience. Our waitress Jazz was super attentive and friendly, and she was rockin some cute earrings too! Can't wait to go back soon", "Margarita N.": "The food was good and the service too. A bit pricey for the amount of food you get in my opinion.", "Mela M.": "Our entrees came out at what seemed to be room temperature. Our food clearly was ready long before it was served to us. We spent $215.00 for a party of four and that was not commiserate with the food we received. Our server Jose took our order and then we didn't see him again until our meal was nearly finished. And even then he made no attempt to refill our drinks or clear the plates that had been left over from our appetizers. While the food looks appealing from the photo everything was cold!", "Jasmine T.": "Fog Harbor is a seafood restaurant located in Fisherman's Wharf. There is a parking garage that validates 1 hr if you eat at certain restaurants, but the hourly rates are quite pricey. Street parking is very limited. Fog Harbor overlooks the bay so there is a nice view for some of the tables. Service: We had joined their Yelp waitlist and were able to get seated quickly. Service was ok for the most part. We had to call our waiter a couple of times. Food came out at a reasonable time. Food: The bread & butter they serve is so good. It was so soft and tasty. We had ordered their Fried Calamari & Clam Chowder in a bread bowl. The fried calamari came in a big portion. It had tartar sauce & a lemon slice as well. Mixed in with the fried calamari was also fried jalape\\xc3\\xb1os & other items such as onions. Everything was very tasty! Would recommend getting this. I had a lot of expectations coming in for the Clam Chowder since the menu said it was award winning. The bacon bites had such a subtle taste. There also wasn't much of it. The bread could've been toasted more and overall our party of 4 thought the clam chowder was pretty mediocre. It was more liquidy rather than chunky. Hope to try other things on the menu if I come back again.", "Stephen S.": "Best Scallops and Shrimps in the Bay Area!!! Must have risotto!! Also, all of their desserts are amazing!", "Ashley N.": "Second time been dinning here. The food was super fresh, ambiance was cozy and the view was phenomenal. Have to give BongJovi our server a big shout out, he is attentive and super fast. Took care of us wonderfully . Amazing experience!", "Olivia L.": "Absolutely loved it with an added bonus!!!I lived in the bay area for my entire life until I moved to Hawaii about 7 years ago so when I come back, I always play tourist (I mean I basically am one now haha). This time around, my best friend and I took the day to explore San Francisco again as it had been years since we came together. We went to Japan Town, the California Academy of Sciences, and finally to Fishermans Wharf, eating our way around the city as we usually do. Our stop at Fishermans Wharf took us to Fog Harbor Fish House as it looked the tastiest out of all of our choices and because it was happy hour. We ordered the steamed clams and a plate of calamari at the bar and shared it between the two of us. We still had hotpot after this so gotta make room for that! To our pleasant surprise, the food was absolutely delicious. The steamed clams were salty, buttery, and flavorful and the calamari was SPOT ON. It's hard to mess up fried calamari in my opinion but you would be surprised how many places to manage to mess it up. Not Fog Harbor though! Our bartender was fantastic and was giving me recommendations for best places to eat in the Bay as I was meeting with my cousin the day after tomorrow for the first time in 7 years. As we were talking, I heard a familiar voice to my left calling my name. I turned and to my absolute surprise, my old coworker from Hawaii was sitting at the SAME EXACT BAR. NEXT TO US. Out of all the places we both could have been and out of all the different times we could have been here, we both chose this exact time and place to sit at the same exact bar right next to each other. This restaurant is so great it literally brought two random people who knew each other from a different state to the same place to get the same food. If that's not telling, I don't know what is. Try it. Maybe you'll meet your old friend from years ago too lol!!", "Anna N.": "The view was great. Our server kept forgetting to bring us what we asked for (clean fork, extra straw, move us to a different table - we were in the walk way and kept getting bumped by passersby era'). The clam chowder was clam-less and over peppery (had better next door) for what was supposed to be \"the best in town\". The lobster roll came out cold and without the \"hot butter\". Had to ask for it and he took 10 min+ to bring it out. By that point, we didn't even want to sit and eat - we just wanted our check. After being there for two hours and barely eating anything - our bill was $400. Overhyped tourist trap. We will not be back.", "Pedro A.": "Service was great! Luis provided us with the best service. From the first time to our table he was making sure we weren't missing anything. To refilling our waters without asking to following specific instructions for our meals. He was awesome! The clam chowder and lobster roll were amazing bursting with flavor. The calamari was good just a little too much on the garlicy side for my taste. All in all we had a great dinner! Thanks again luis!", "Renata K.": "Luis is great. The restaurant is amazing, never fails to welcome locals and out of town visitors. It won't disappoint!", "Caleb J.": "Nice view/very nice and classy ambiance Great selections Friendly and professional staff Very tasty (Serves daily caught fish less than 3 miles away) SOURDOUGH BREAD = TO DIE FOR", "SSheva N.": "We are here two times on our trip and the clam chowder, clams and burgers were amazing! We really enjoyed our experience. We were honored as a military family too with a percent off and a dessert gift at the end of one of our meals thanking us for our service. The view is beautiful and the team members happy and professional.Clean and well put together.Thank you very much! We really enjoyed our two experiences! Keep up the great work!", "Kevin K.": "Luis was such a friendly and excellent server. Made our dining experience great. Food and appetizers were some of the best seafood I've had. Would definitely come back.", "Jin L.": "This place is busy. Our server was very friendly and worked very hard. The food is great! We had clam chowder, steamed clams, clam pasta, and drinks. The clam chowder is so good with the bread! We enjoyed our visit here. My son wasn't feeling well that evening. He got food poisoning from this place so I took off one star.", "Alice K.": "Luis was our server and was without a doubt the BEST! The food was amazing and the view unbeatable! a solid 5 stars!", "Jo D.": "We had a lovely experience with Luis as our waiter. The food was amazing, the creme brulee for dessert was astounding truly enjoyable meal", "Dave B.": "Fog Harbor is well known for their amazing seafood dishes. I want to comment on their other dishes, the steaks!My son and I love to eat at good steak houses here in San Francisco. We both agree that Fog Harbor has an amazing if not the best filet in the city. My son (13) likes his filet medium well (yes I know) his comments is the filet is tender and almost melts in your mouth. My filet was medium and had a nice char while still keeping on the medium side through out the filet. The grill marks added to the taste and presentation. My drink was a mojito and unlike some other restaurants had a fair amount of alcohol. Not over powering. I felt it was just right. As far as the service goes, nice staff. Food came out at a good pace even with it being as busy as it was. Nice view, ask for one if you can. You may wait a little longer but worth it.", "Sharine d.": "Wow... Tourist trap and all.... Food is delicious! Had crab cakes A++. And risotto crab and scallops.... Perfect dish!!! Thank you everyone who assisted today. Wonderful food. AAA+++Warm appreciation,Sharine", "Jon S.": "The food was good! Our server Mearilyn had great customer service and recommended the mixed grill which was pretty good as well.", "Vivian C.": "Fresh and tasty seafoods, excellent services and beautiful ocean view with Golden Gate Bridge in the backdrop. Highly recommended the seafood platter.", "Jen W.": "I'll be honest...I usually stay away from restaurants on the pier. I always think they're over expensive and tourist traps.Well, with over 7k reviews and it being restaurant week, we said what the heck! And I'm thankful we did.I made a reservation for 4 and we had a great table by the window. Our server, Shawn, really made our experience a memorable one. He had great recommendations, came to check on us multiple times, and ensured we were all good for our entire experience. For restaurant week, they were offering a 3 course menu for $65. Here's what we had at our table:Appetizer:Ahi poke nachos Baked oystersEntree:Ciopinno (add scallops)Scallop and crab risotto (add shrimp)Dessert:Warm chocolate fudge cakeVanilla bean creme bruleeThe entrees knocked it out of the park. The cioppino was packed with fresh seafood. The scallop and crab risotto was cooked perfectly. They definitely didn't skimp out.Happy hour seems really enticing which they offer M-F. I'll definitely come back for that. This spot is bang bang for tourists. Great for a special night out for locals. 5 solid stars for amazing service and delicious food all around."}, "House of Prime Rib": {"Mark Y.": "Haven't been to the House of Prime Rib in years but thought my brother and I would go by and have a few beers while waiting for a table. The wait time was long (90 minutes, although we were warned). The food was good but the service by our waiter named Blue was OUTSTANDING! His attention, demeaner and humor made our evening out extremely enjoyable and very memorable. It is not very often you run into such a great personality. Thank you Blue", "Jerry W.": "$16 Valet Parking if you cannotfind parking.Our reservation was for 630PM. We got here at 550 and found parking 1 block away. If you want you can always get a cocktail at their bar while you wait. We got seated at 608PM.Fresh sourdough bread and butter... what can be better?Corn bread needs to be warmed up. The bread is sweet.Love the salad...its the dressing that seals the deal for me. I usually do not like beets but I will eat it here.The spinach is bit salty today, but the King Henry Cut with bone is simply delicious and filling. I did not have room for dessert. The horseradish is the best... I like the hot one... the medium and mild is just too creamy and I don't get the sinus clearing effect. They actually leave a small boat of au jus at the table to add to your plate... excellent.Men's room... 2 urinals and 2 stalls. Changing table. Very well lit... lots of mirrors. Very busy. Well stocked.", "Bryan L.": "They do have valet parking on Washington Street. There are street parking spots, but they are metered so get ready to pay, especially prime dinner time.We have not been to HPR for over 2 years and its good to be back. Love the salad... this is the only time I eat beets. The dressing is sweet and tangy. The only thing off is that there is a bit too much dressing for my liking.Today, my youngest ordered the House Cut, cooked medium. It looked a bit on the medium rare side, but with the din lighting it was a bit hard to tell. He was staving so it really dkd not bother him.I ordered the Henry VIII cut so it had the bone...love fighting my dog over it!!!The baked potato was simply the best, but it looks like they used a quart of a stick of butter and a quart cup of bacon bits... not complaining, but man was it good.I love prime rib and I love it even more here aince I did not have to cook it and clean ip afterwards.", "Katrina N.": "Make reservations way ahead of time. Place is generally booked and booked solid. Even with a reservation be prepare for a wait... good luck on walk ins.First of all the bread is fresh and hot, though the butter is cold.The entire meal comes with a house salad and prime rib with all the fixings...creamed corn or spinach and mashed or baked potato. Really filling.  Dessert... apple crumble is off the hook. The strawberries in the strawberry shortcake was a bit sour.", "Jennifer N.": "The atmosphere here is always nostalgic, almost like you've been transported back in times. If you're trying to eat here either book a reservation way in advance (4+ months) , find an open spot on open table, or walk in and wait several hours( if you have that time ). The service here has always been top notch, you get a small show when they make your salad , and baked potatoes at your table. Watching them carb the meat is always fun to watch if you have a good angle of the cart. All items here are delicious, would recommend to anyone who has a chance to dine here, and make a reservation in advance.If you do schedule in advance , they will call you several days before your reservation to confirm , I've been told if they don't hear back from you , they will cancel the Rez.", "Anh N.": "I LOVE house of prime rib! I come here whenever I'm able to snag a reservation. I don't normally like prime rib, but this place is my only exception. Everything about this place is great and I have no complaints. Some tips are:- you and someone else can share an entree with a $10 plate charge. With the fee, you get your own set of sides! I think this is very worth it if you can't finish a meal yourself -book in ADVANCED because reservations are hard to come by -if you're ordering your own entree and finish all your meat, you can ask for seconds for no extra charge!!! Please come here, it's absolutely wonderful and definitely worth the price!", "Wendy C.": "So amazing!! Best meal in San Francisco yet, it is worth every penny. Highly recommend making reservations, we had to make it 7 months in advance (if you want to snag a normal dinner time); otherwise expect to either wait a few hours walk in or reserve whenever at like 10pm. They make it really easy for you to choose since there's not much on the menu. So the few items they have, they do it really well. Surprisingly, they had a sea bass that was off the hook! Everything was absolutely amazing. Thank you again for a wonderful evening!", "Alexander C.": "HOPR is a must try! It's been around for so long for a good reason...a delicious reason! There's never been a time when I've went here that this place is empty. For self parking there is street parking and a paid parking garage around the corner but I'd recommend valeting your car for $16 cash and avoid the headache. There are no atm machines inside but you can get cash with your credit card from the bartender. Reservations, especially prime hours are really difficult to make even months out in advance as they are always booked. I've noticed if you have a larger part of 4+ more openings are available. We often do a walk in and wait 2+ hours for bar seating but luckily this time around a table opened up before the bar seating did. Sitting at the table just feels more intimate and less rushed. There are waiting area by the bar as well as in the hallway. It's less likely that you are able to wait at the bar itself since people are dining there. While waiting to get seated I ordered a lemon drop with the cocktail waitress. It's very light and delicious. I like that they give you the shaker as well so you're getting at least 2 drinks.Once we were seated we had a great time at HOPR per usual. Antonio was our waiter and went above and beyond of what was expected. He actually made our visit here the best one we've had. He was very personable and made sure we were well taken care of.We ordered:*The King Henry VIII cut: a thicker cut of prime rib *The English cut: a thinner but more flavorful cutWe had more food than we can eat but we had to grab seconds. It's hard to say no to more of their perfectly cooked and seasoned prime rib dipped in horseradish sauce. Hector, the meat cutter was also very friendly and made sure our second slice was still warm and came over to pour some au jus to make sure our slice was juicy. The folllowing came included with our meals:*Salad: we opted for no seasoning since it makes the salad too salty. They freshly mix a large salad bowl with their house dressing in front of you and serve on cold plates. We asked to take the rest in the bowl home since they end up tossing it out. Such a waste IMO. *Sourdough bread: So good when it's fresh and warm especially with butter*Creamed spinach & creamed corn: normally one or the other is offered but we ordered both. They no longer serve half orders of each so we had the full portion. It's worth it to just take it home and finish the rest.*Yorkshire pudding: thin and crispy on the outside and warm on the inside. Doesn't taste as good when taken home and reheated.*Mashed potatoes/baked potatoes: we opted for the creamy mashed potatoes and gravy but if you're getting the baked potatoes you can get it fully loaded with sour cream, chives and bacon.If you happen to have room for dessert their warm apple crisp is one of my favorites. It comes with vanilla ice cream on top and is not overly sweet.", "Andrew N.": "It was my first time trying this place out even though I passed by this area many times. I made reservations few days before coming, and got a spot for 9PM. The restaurant was a bit dark and had tons of tables/booths. I ordered the house of prime rib cut (medium) with mashed potatoes and creamed spinach. They served bread with butter and a plate of salad before the food came. For the steak, it was a pretty big portion and the meat was super tender. It went well together with the mashed potatoes and creamed spinach. You can also get free slice (refill) of the steak once you finish your portion. The service was good since the waiter would check on us ocassionally. Overall, this spot is a nice place to celebrate special occasions for dinner. I would take my family here to try it out next time.", "Michelle M.": "It can be truly difficult to express how great this restaurant is. It is a San Francisco institution for sure. This is my third time dining here over the past 15 years. I don't often get a chance to visit San Francisco, and even more rare are the opportunities to get a reservation. Fortunately, this time around I was up in the Bay Area for work and had a chance to dine solo, so I took a chance with a walk-in.It's important to note that their reservation system via Open Table only allows parties of 2 or more. So that means dining solo involves walking in and asking for a table or get on the wait list for the bar top seating. I dined on a random Wednesday evening around 6pm. The wait for a table was going to be 2 hours, so I decided to take my chances with the bar seating. You need to ask the bartender to add your name to the list, and they will call out your name when a seat(s) open up. There are approximately 8-9 seats available. I waited about 30-40 min. If you're l by yourself, it's a little bit faster compared to pairs or more because the bartenders try their best to keep your party seated side by side. As for the meal itself, just simply \"WOW!\" The menu is quite straightforward: select the prime rib cut size, how done you want it cooked, and a few choices on side dishes (cream corn vs cream spinach and mashed potato vs baked potato) that are included as part of the whole meal. The rest of the meal automatically includes sourdough bread (from Boudin by the way!), salad, and Yorkshire pudding. The bartender staff were quite engaging and dining with fellow guests and striking up conversation made the whole experience very enjoyable!Highly, highly recommended coming here if you're looking for a great restaurant and delicious meal!", "Chelsey Y.": "We were able to get last minute reservations for dinner through OpenTable - highly recommend! I loved the vintage interior and the details - a really good casual/dressy ambiance for a date/special occasion. A perfect place for meat lovers - the portions are huuuge and if you finish your prime rib, you can get a second one! The sides were equally as good as the prime rib. I wouldn't recommend the bread pudding - I think that I've had better versions elsewhere but it was serviceable.", "Carmen C.": "I've been to the House of Prime Rib a couple of times before the pandemic and this is the first time dining in since. I made a reservation through OpenTable about 3 months beforehand, I had to check a lot to snag a one. It was for our anniversary and I was craving Prime rib.The reservation was for 10pm and I got a call a day before the reservation date to confirm. We were able to find parking the next block over.The restaurant was filled with people and it was loud, you have to talk loud to let the host know your name.I used my phone to show my reservation because they couldn't hear me.I read that a few Yelpers showed up an hour and a half early and they got seated an hour early from their reservation.We tried this and nope (this was a Sunday) we did get seated about 15 mins early from 10pm. We waited an hour near the bar area, and a friendly staff came over to ask if we wanted to order drinks.We got water and the napkins were printed with their logo.Staff would come over and refill our waters too.Once it was our turn to be seated a staff will come over and call your name.We were seated in the mini booth perfect for 2 people. It was well lit in this front area, I've never sat in this room before.I've only sat in the rooms where it was super dark. Our server was friendly and excellent.Husband and I both ordered the King Henry Viii cut with mash potatoes and creamy spinach.First came the bread with a cube of butter, it was hot pipping inside, love it so good!Then came the salad, where we each got a cold fork.I like how they demonstrate the mixing of the salad (I ate all my salad.)Then came the chef who introduced himself and cut our Prime Ribs. I was able to eat half of mine before I got full and my husband ate all of his.Theres 3 different types of horse radish, I only tried the first 2.They also gave us extra au jus sauce on the side. After we were done, the staff wrapped our food in foil and put it in their red to go bags.I wanted to take the horse radish and they gave me a fresh one. We ordered crime br\\xc3\\xbbl\\xc3\\xa9e for dessert and as a special treat for our anniversary they gave us a sorbet with candles so cute. We devoured both desserts. Overall great food and excellent service!", "Sean L.": "While I'm a bit embarrassed to admit it, my family and I dine at this restaurant almost once a month for family dinners or special occasions. I must say that we've never had bad service here. Given the restaurant's popularity, it's natural to expect some inconsistencies in service, but this place rarely fails to meet our expectations.Last Sunday, my wife planned a celebration dinner with her classmates and teacher from the culinary program at CCSF, and we had several first-timers in our group. Our server was amazing, not only nice but also super attentive. Thank you to the General Manager for accommodating our seating arrangements and allowing both of our parties to be seated together despite the original front desk person's advice that we couldn't have such a large party. It's not easy to manage during peak dinner hours, and we are deeply appreciative of the efforts.Everyone in our party thoroughly enjoyed their meals and plans to return. As for us, we absolutely love this place. We've tried numerous steakhouses, but the House of Prime Rib still delivers the best prime rib hands down.. For those who haven't tried HOP yet, I highly recommend it. Some may find it expensive, but the portions, including cornbread, sourdough, salad, and two sides, and occasional complimentary slice, make it well worth the cost.", "Katherine G.": "I've been trying to get a reservation for this spot since forever, but they always seem to be completely booked out. However, I was finally able to come with a large group of 11 for a very late (9:30pm) dinner. I don't think they even typically offer reservations for parties of that size, which was evidenced by the fact that we were seated at two merged circular tables.Upon being seated we were given complementary bread which was a whole round of sourdough. It was still warm and so delicious! Crunchy crust and soft interior. They also give complementary salad with your prime rib which had a really unique and delicious dressing. For the main, I chose the house of prime rib cut which was enormous! It came with a side of mashed potatoes and gravy, and I chose half corn and half spinach for the other sides. They also gave another piece of some kind of bread, which I forgot the name of. The prime rib was so so tender and juicy, and was certainly the best prime rib I've ever had. It was well seasoned and paired so well with everything. They give you a free complementary small slice if you finish your entire piece, but I could barely get through half of it :\"). Plan to come hungry!The price is quite high but not unreasonable for the quality and quantity of food you're getting, as well as the great service. I would certainly recommend this spot as a celebration for something or if you're just looking for a nicer place to dine. So worth it!", "Karina P.": "Amazing experience, food, and service!! I have come here a couple times and have nothing but good things to say about this place! Reservations are impossible to get so book months in advance to ensure you have a spot.The portions are huge and I love that they give all the sides with all orders of prime rib. I have gotten the House of Prime Rib Cut and the English cut, both were amazing! If you are up for a challenge, try the King's cut. If you are able to finish your whole prime rib, they give you another slice on the house!! Wild but give it a try -- my brother and bf have both successfully gotten a second slice. I love the cream spinach, baked potato, and salad. The salad is a creamy chopped beet salad and I could probably eat 5 bowls of it. Overall this place is a treat, and I guarantee you will have a good time. The ambiance is old style and lovely with servers who have lots of experience. The martini's a strong and the food is flavorful...what more could you ask for!", "Lydia C.": "The menu is pretty easy you either get a thick, cut a small cut or thin slices and you have a bunch of sides. In my opinion, the baked potato is the heartier side and you can ask for baked potato toppings on your mashed potato if you want for an extra charge. they even give you extra slice of prime rib at the end if you are still hungry for no charge. Almost every table around us was a birthday and they give you a free birthday dessert and it was really cool to see everyone celebrating. The restaurant has an old-school Vibin. All the waiters and waitresses are dressed really nicely and the vibe of the place is really wholesome. The service was immaculate, if it's a celebration, they usually take a photo for you and then they give you the photo as a souvenir to take home.", "Monica C.": "My favorite prime rib restaurant in SF is no other place than HOPR!!! So good that my stomach is rumbling just thinking about how delicious their prime rib is. Their services are outstandingly exceptional! The ambiance is fine dining but they are louder than French fine dining restaurants. Although the restaurant is large with multiple rooms, bar seatings, and a waiting area, they get booked out months in advance. This is also my mom and husband's favorite restaurants so I have been here more than 20 times. My mom never gets satisfied when we bring her to other fancy steak restaurants, even when we take her to Burlingame Prime with the previous chefs from HOPR. In the end, she always compare and say HOPR is better. In the last ten years including the pandemic, we have been coming here at least twice a year for Mother's Day and for my mom's birthday celebrations. HOPR is also very special to me as this is the first fancy restaurant my husband and I celebrated our six month dating anniversary after high school almost 18 years ago.As mentioned, this is a prime rib restaurant so it is the number one thing everyone coming here should be ordering. My family including my siblings, husband, mom, and myself, always order the King Henry Viii (the largest cut) and get seconds for free after we finish the King Henry Viii. Their prime rib is super juicy with the hot au jus sauce poured right on top. Eat it with some of their homemade horseradish sauces and man, so mouth watering! The only prime rib I happened to not enjoy here is the seared one, which I ended up getting during my pregnancy since I avoided eating medium raw meat. It does not taste even close to the regular medium raw juicy flavored prime rib I am used to. Do not recommend that cooking style. Another big thing here is they have people moving the giant cart with the prime rib and doing a show where they carve the delicious prime rib in front of you! It enhances the experience and makes you more excited to eat it. The prices are not expensive either especially if you compare it to other steak restaurants like Alexander's or 5A5 steakhouse.My favorite sides are their creamy corn and baked potato as they stuff their baked potato with so much delicious toppings and bacon. My husband and mom likes their creamy spinach. They also have cornbread (secret menu) that you have to ask for. I am not the biggest fan of their Yorkshire pudding (for that one, I actually like the Burlingame Prime one better). My other favorite item is their famous house salad with their homemade salad dressing. It comes out cold and refreshing! So yummy that I eat two plates of that before I eat the King Henry and finish the free second prime rib slice. The salads and prime rib at Burlingame Prime or San Mateo Prime cannot compare to HOPR. There is just something different about the food here despite having the same trained chefs from HOPR. Overall, it is well worth the bookmark and to try if you are a resident or tourist visiting SF for the first time. They also take a picture and give you a copy for birthday celebrations so you can keep it for your memories! Absolutely love this place! Yes, it is indeed my most suggested restaurant in SF to anyone who ask me for food recommendations.", "Madeleine Y.": "House of Prime Rib is an SF staple! I come here at least once every 1-2 months because of how good the food is. I have recently been getting the city cut because I think it's definitely more flavorful and great paired with the mashed potatoes! I get double potato with mash and a baked potato because I don't care too much for the cream of spinach or corn. This place is continuously consistent and I have never had a bad meal here. I recently brought my friend here too and he loved it! The ambiance is always great and not stiff. A great place for dinner with a loved one or friends! Pro tip: make sure to ask your server if they have fresh corn bread because it's my fave!!!", "Ashley H.": "Love it here. Came right when it opened at 5pm because I was craving prime rib, sat next to the bar and enjoyed a glass of wine, and we were seated in an hour. Cool and attentive service from the waitstaff. Love that they explain the menu to you and are a little theatrical. Makes for a great experience. Food is delicious! Thick and juicy prime rib, great sides. I feel like you really get what you pay for. We were so full afterwards and had to take leftovers. A nice extra is that they give you three types of horseradish (by \"spice\" level).", "Minh C.": "I've been to House of Prime Rib many times and they seem to disappoint. Service and food quality are always top notch.My wife made reservations for my birthday 3 months ahead to get a spot and it was well worth it. We had a party of 9 with kids and they were so accommodating.I got my usual King Henry cut cooked medium. I decided to pass on the cream of corn and spinach for a baked potato and mashed potatoes. The aged prime rib was a borderline medium-well but still very tender.My son doesn't do steaks or roast so I asked if they could substitute the kids beef cut with salmon instead and they were so accommodating considering kids are so picky. My wife got her prime rib seared. Tip, they only sear the King Henry. Although it was very smokey I felt like you miss out on the dry aged flavor with the seared rib.They also gave me a birthday sorbet which was also amazing. My wife got the house made Tiramisu and loved it.It was a great birthday treat. I would definitely come back for more. Highly recommended. It's one of the places I still visit the city for.", "Gaby A.": "Always fun and a special treat having dinner at the House of Prime Rib! Definately a go to in our family for special celebrations! You cannot go wrong with any of your meal choices. The martinis with extra olives are made perfectly! All the desserts are delicious! My favorite is the creme brulee! Service is quick and all the hostesses are very helpful and prompt! They make you feel special and the meal is so beautifully presented! The tossing of the salad on ice is fun! You do need reservations as they book out far in advance and they can get pretty busy. Parking is easy if you do valet!", "Andrew John D.": "Excellent delicious savory food! Great friendly service! Yes, pricey but totally worth it! Atmosphere is fun very busy! Cocktails are great! Love that they have valet so parking not an issue! Fyi if in the City don't forget they charge the extra tax on your bill!", "Angelene C.": "Been coming here for years and just celebrated my birthday here for a second time! The food quality and service never fails me even after all the time I've been here. I always love coming here for a special occasion and I'm obsessed with those corn and spinach dishes on the side! It ties in the prime rib so we'll every time. And I always go for the potato over the mashed ones.Highly recommend for anything thinking of celebrating something special here for the first time! Don't forget that they will offer you seconds, so don't be afraid of finishing fast. (Note: the prime rib that comes as a second won't be nearly as large as whatever cut you order) It does get a little loud or busy inside just a note.", "Joyce S.": "Came here with my aunties visiting from out of town, we made a reservation prior to the date, but they were still extremely busy on a Thursday night. Waited to be seated and once we got our table, had to wait for our server to finish serving other tables before getting to us. Which they were busy so we understood. First comes the salad, then you will wait to put your order in for the prime rib plate and sides. We all got the city cut, which was honestly a perfect size for me. The prime rib itself was so juicy, soft, and packed with flavor. The side of creamed spinach was amazing and the mashed potatoes were also very delicious. My aunts got the baked potatoes, which they said was good too! Overall, a great restaurant, and an SF classic. Just make sure you have patience with the service, and make a reservation beforehand because they might not have space!", "Bethany K.": "I had high expectations for HOPR since this was my first time but unfortunately I was not impressed. Made a reservation almost half a year in advance and upon arrival we waited around the bar as they were waiting for some tables to clear.The restaurant was so loud and our server was too busy running around to pay much attention to us. We waited a really long time to order and it was almost impossible to get his attention during the meal. We started off with the salad and the dressing on that was really good. I got the city cut and as a smaller eater I would recommend this as I was pretty full after. The creamed spinach was smokey and flavorful. The mashed potatoes however were just alright and not anything special. The restaurant was just too hectic and loud for a comfortable meal. The service was also lacking as our server was never around. Nice to try but probably won't be back again.", "JACK M.": "This place gets busy and reservations fill up very quickly. We decided to try walking in around 3:45pm and got seated right away at the bar. We got VERY lucky because less than 5 minutes later, a huge crowd of people came in and all of the seated were filled. Valet parking is $16 or you can try to find street parking.We both ordered The House of Prime Rib cut and it was delicious. The trio of horseradish sauces pair so well with the prime rib. You can tell why this place is so popular once you try it. They started us off with salad and bread with butter. For the sides, they give you the option of mashed or baked potato, and creamed corn or spinach. They also give you Yorkshire pudding. If you are still hungry, you can get a small second slice for free.Note that bar seating is very crowded due to limited space. It was still a great experience and I would highly recommend coming here.", "Alexx R.": "Wow. What an amazing experience. The place lives up to the hype. The service was beyond exceptional. Plus they give you seconds on the house.", "Christina A.": "I have to say I was little skeptical of House of Prime Rib when my friend suggested we go there. I am a steak girl all the way but prime rib I'm whatever about. We went on a Saturday around 7pm without reservations (rookie move I know) but put our names now and the wait was about an hour or so. The place was packed so an hour isn't bad if you ask me. I ordered the expresso martini as my cocktail, was one of the better espresso martins I've had. Loved the salad! The beats were such a nice touch and whatever house dressing that is so delicious. The prime rib was of course great. Creamed spinach also great. Baked potato BOMB. The meal was overall just great, next time I'm in San Francisco I'm going back...and making a reservation.", "John P.": "The good:We scored a reservation and it was so worth it. The prime rib is outstanding.3 horseradishes are better than 1The baked potato was incredible. Who puts that much bacon on a potato? I'm going to dream about itThe service was spectacular. It was so busy and it never felt like it.The ambiance was lovely. The bad:The difficulty in getting a reservation. You must book a year out. I was told to book in open table so you can get notifications of openings.I'm going to regret eating here because who knows when we will be back. It's a lot of food and the desserts looked so good. I had no room.Parking at 5 may be difficult. You can always valet for $16. It might be worth it if you have someone who has difficulty walking.", "Carmen Z.": "Didn't have a reservation on a Friday, so I waited in front around 4pm. Doors opened at 430pm and we were able to get a seat for 2 at 5pm. If you don't have a reservation, I highly recommend going there before they open around 4pm because people start lining up around 420pm.We hung around the bar and had some drinks before they seated us at our table around 5:05pm. Our server was Alberto. Hands down the best service we've ever received and we frequent this place a lot. He was very well spoken, had a fun personality and just seemed really happy to be there! Thank you Alberto for A+ service! I always get the King Henry Viii Cut because why not?! It's not that much more expensive than the other cuts and you get more! Cooked Rare is always the way to go with Prime Rib. I'm not a huge fan of the spinach side, so I replaced it with the creamed corn which is super good. The Salad is delicious and I love the dressing and the beets.If you haven't been here, then you're not doing San Francisco right. This place is a staple and once you eat here, you'll know why."}, "Gary Danko": {}, "Foreign Cinema": {}, "Tony’s Pizza Napoletana": {}, "Liholiho Yacht Club": {}, "Brenda’s French Soul Food": {}, "Nopa": {}, "State Bird Provisions": {}, "Kitchen Story": {}, "Harborview Restaurant & Bar": {}, "Farmhouse Kitchen Thai Cuisine": {}, "Tartine Bakery": {}, "San Tung": {}, "Rich Table": {}, "Acquerello": {}, "L’Ardoise Bistro": {}, "Loló": {}, "Birdsong": {}, "Hinata": {"Vivian C.": "A wonderful, blink-or-you'll-miss-it omakase spot on Van Ness!First off, I'd recommend making a recommendation. They do ask for your credit card as a deposit in case you cancel less than 48 hours before your reservation or no show. They will charge you the full per-head headcount of $125. You can also request the small room that can seat about 6ish people right by the door if you want a more intimate seating arrangement. Our party got the full omakase set with no additional add-ons. I loved that each small dish was packed with so much umami flavors and textures. My favorites were definitely the nigiri, soup, and dessert. There are also some add-ons for additional. The service was so quick and prompt to clear each of the dishes, present the next dish, refill waters/drinks, and providing more ginger. The whole dining experience took approximately two hours. There is street parking located but would recommend avoiding parking in the alleyways.", "Carol N.": "Another great evening at Hinata with Chef Gavin. We added the supplement with otoro, Bafun uni, & A5 Wagyu. I even had room for the Hokkaido hairy crab off of the a la carte menu (& chef recommended after I loudly said it piqued my interest). Solid price point for everything you get. My highlights were the tuna, Kinmedai (always), & anything seared with that magical torch. Washing everything down with hot green tea was perfect (green tea over sake).The house made Yuzu Sherbet was the perfect blend of sweet, burnt crispiness, light, citrusy, & creamy. Cannot tell you how much I enjoy the thoughtfulness & detail that goes into the menu. My tummy feels so well cared for every time I leave (like a warm food hug from my mom). #iykyk I asked the chef what his favorite month for fish is to look into when I'd like to book my next omakase tasting. Chef Gavin said every month is wonderful & different... so I guess I'll just keep going without thinking... Who wants to come with next?Omakase tasting - $125Supplement - $41Hokkaido hairy crab - $10+Green tea - $5+", "Loryn F.": "Came here for the omakase with the supplement. The boyfriend and I had a great experience! I don't usually eat a huge meal, but I was able to finish everything including the supplement with absolutely no problem.Attentive servers and the sushi chef was wonderful.Solid spot for your sushi bar omakase experience. Would happily go again for the price point.", "Lety C.": "This is the BEST Omakase in San Francisco, and honestly, better than the Omakase I have had in Tokyo. This review is long overdue since we are repeat customers. I should start by saying, ask for the counter seating when you make a reservation because the interactions with the master chefs are part of the incredible experience. The artistry and preparation of the fish is truly part of the dining experience and is not to be missed.It truly shocks me that Hinata has not been granted a Michelin star because the food, service and quality are top notch. It is a very traditional Omakase (Literally meaning 'chef's choice) but every visit surprises me with incredible flavors, combinations and fish so fresh, you would swear it came directly off the fishing boats in Tsukiji. This is now our fifth visit, and it will not be out last. Whether you are an Omakase veteran or a sushi novice, this experience will heighten your appreciation for the craft and leave you wanting to return time and time again.Each course build upon the last in a masterful way and I highly recommend pairing with one of their sake. There is an add on tasting as well if you prefer to taste a variety but we always select a bottle and are never disappointed.The ambiance is perfect for date nights or special occasions but not so stuffy that you could not enjoy a meal here any time!The photos speak for themselves in terms of beauty, but the taste can only be experienced in person. I HIGHLY recommend this place to anyone wanting a one-of-kind Omakase. It's a 11/10 every time.", "Mikaela C.": "This might be my favourite sushi experience in the city so far. I've been to Michelin starred sushi in the city but the quality of this whole experience was incredible. Creative but simple. All seafood straight from Japan and top quality. Service and ambiance make you feel like you are in Japan. A generous sake/wine pairing with top notch selection. Every single dish was specially prepared. My favourites were Shima-aji nigiri, the otoro and wagyu for obvious reasons and the blowtorched barracuda. Every detail is well thought. Presentation is spotless. Can't find no fault.", "Jacky C.": "This was my first omakase experience and had a wonderful time! We made a reservation a few months in advance for a party of 2. Parking is extremely limited in this area so definitely reserve time to just find parking. The interior of Hinata is very minimalist and intimate. There was the bar area and then a few tables as well as a waiting area. We were seated at the bar and our chef Tulga was very welcoming and friendly. Service in general was friendly and attentive. There is a set menu that they give you. It's $125 a person and you could also add caviar for an extra $30. They also had other items that you could order after the set menu is done. Our chef would give us a brief history and would explain each nigiri to us which I appreciated. He would also recommend how we should eat it and what flavors to keep an eye out for. The pacing for each nigiri was pretty slow, but it definitely gave me time to digest and I know he was doing his best to make everyone their nigiris so I have no complaints! It is just something to be open about if you tend to eat quickly. Overall, I would definitely come back again for another occasion. Thank you Hinata and Chef Tulga for the wonderful experience.", "Elle F.": "I went here two times so far a while back and both times it was a great food experience from my recollection.The service was great where the chef is preparing the food and also trying to make conversation with us. They were serving as well as explaining what was being served. The amount of variety of different dishes within this Omakase and Omakase's in general in my eyes is a little above the normal course meals. Which I love. That being Japanese food, especially sushi is my favorite cuisine. The different little dishes away from the sashimi and Nigri were amazing and so diverse and always delicious. The sashimi and nigris they serve are fresh and amazing as well. My favorite is a torched toro Nigri. Overall I think Hinata is a great place and a great experience if you're trying to have a good omakase around 100 dollars (Was 90 back when I went a while back). Usually at the end of the meal, I'm never full. So if you're someone who eats a lot as I do I would recommend eating beforehand. But recently they increased their prices to $110+ ,if they didn't add anything extra and they increased the price I think you should try looking for another place.", "Cindy L.": "Wanted to plan a nice birthday dinner for the sis and Hinata didn't disappoint. We had reservations for 4 on a Saturday evening. Our reservation was at 7:45 but decided to get there at 7:30 since I wanted to make sure we sat right at the bar. I also notated that in the reservation but took extra precaution just in case. We are celebrating a birthday of course and wanted to make sure we had that full experience.The place was small , intimate , cozy and had that minimalistic feel. Since we were one of the first to arrive , we were seated around 7:45 and I sat right in the middle of all the action. It was a great start to the night. We had chef Tulga that night and he was super friendly & made us some bomb nigiri. Ordered some hot sake to get the night started.The tasting menu consisted of 14 courses. It was $125 pp .$35 for caviar & the supplements which consisted of 3 nigiris was another $37. It can get pretty pricey when you're adding everything .... But hey it's A ok when there's a Birthhdaaaaayyy . For the appetizer portion there was 3 dishes. My favorite was the ocean trout. It was super light & refreshing. Umimasu - Ocean Trout* Mozuku - Okinawa SeaweedUmaki - Eel Rolled OmeletNIGIRI Kanpachi - Amberjack KagoshimaHirame - Flounder KoreaKinmedai - Goldeneye Snapper Tokyo(C) IKURA UNI - Salmon Roe/Sea Urchin*( C) Hotate - Scallop Hokkaido *Hon Maguro - Bluefin Tuna NagasakiKasugodai - Young Snapper MieSAWARA - King Mackerel Shizuoka*Sanma - Pacific Saury HokkaidoKamasu - Japanese Barracuda Chiba*(C) ZukeChutoro-Medium Fatty Tuna *Negi Toro - Fatty Tuna/Pickled Daikon*I placed a star next to my favorites of the night . As you can see I loved each nigiri that had the caviar! All the pieces were super fresh & the quality was immaculate. Overall I had a great time , the food was good and the company was even better.", "Olivia F.": "Amazing food, service, and experience. If you're looking for a quality and moderately priced \"high end\" omakase experience then this is the spot. (I call this moderately priced as a similar omakase experience for the quality easily costs $200-$400 at other places in the city)We made reservations for a weeknight at 7:45pm and were the last group to be served for the evening. We got the omakase menu with a few a la carte pieces at the end because it was soo good.My favorites were the otoro remix, uni, and the hotate (scallop). Everything tasted fresh, buttery, and flavorful. I liked the dedication and care the chef spent in crafting each piece. They also explained each item as they serve it to you and they match the speed at which they make each piece to each individual in the group. You can tell they want the experience to be perfect for each individual. The service from the waitress was also great as she refilled my tea every time my cup was empty and I drink a lot of tea.", "Andy M.": "I would give Hinata more than five stars if I could. I recently had the opportunity to try their amazing omakase as part of a holiday party. Initially we were a bit skeptical due to the location (if you approach the restaurant via Eddy street). However, once we entered we were pleasantly surprised by the serene decor and friendly staff. We were with a group of ~20 and began the night by drinking wine and mingling at the front of the restaurant. From there, the group split to either eat at larger tables or at the omakase counter. We fortunately sat at the counter right in front of Gavin (the owner). He conversed with us through out the different stages of the meal - educating us on the fish, the etiquette to eating, and even let me try the uni ahead of time as I was a bit wary about it.Every single piece was exquisitely created and the flavors screamed umami. My favorites were the striped jack, scallop, fatty tuna, and wagyu."}, "The Morris": {}, "Limoncello": {}, "Mensho Tokyo SF": {}, "La Fusión": {}, "Tadich Grill": {}, "Mama’s On Washington Square": {}, "Beit Rima": {}, "Anomaly SF": {}, "Pearl": {}, "Good Mong Kok Bakery": {}}